gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt336s.h
/*
--------------------------------------------------------------------------
CPU - CPU
--------------------------------------------------------------------------
*/

#define CORE_VERSION  V3XJ

/* CCP signatures */
typedef enum CCP_enum
{
    CCP_SPM_gc = (0x9D<<0),  /* SPM Instruction Protection */
    CCP_IOREG_gc = (0xD8<<0),  /* IO Register Protection */
} CCP_t;

/*
--------------------------------------------------------------------------
CTE - CTE Module
--------------------------------------------------------------------------
*/

/* CTM Module */
typedef struct CTEMS_struct
{
    register8_t MSCRA;  /* Micro Sequencer Control Register A */
    register8_t MSCRB;  /* Micro Sequencer Control Register B */
    register8_t reserved_1[1];
    register8_t MSPSEL;  /* Micro Sequencer Page Select Register */
    register8_t MSSRACLR;  /* Micro Sequencer Status Register A Clear */
    register8_t MSSRASET;  /* Micro Sequencer Status Register A Set */
    register8_t MSSRB;  /* Micro Sequencer Status Register B */
    register8_t MSSRC;  /* Micro Sequencer Status Register C */
    register8_t MSSRD;  /* Micro Sequencer Status Register D */
    register8_t reserved_2[1];
    register8_t MSCCR;  /* Micro Sequencer Condition Code Register */
    register8_t reserved_3[2];
    _WORDREGISTER(MSLRR);  /* MS Link/Repeat Register */
    register8_t reserved_4[1];
    _WORDREGISTER(MSPC);  /* MS Program Counter */
    register8_t MSHIF;  /* MS Host Interface */
    register8_t reserved_5[1];
    register8_t MSIR0;  /* MS Instruction Register 0 */
    register8_t MSIR1;  /* MS Instruction Register 1 */
    register8_t MSIR2;  /* MS Instruction Register 2 */
    register8_t MSIR3;  /* MS Instruction Register 3 */
    _WORDREGISTER(MSIRBUF);  /* MS Instruction Register Buffer */
    _WORDREGISTER(MSR0);  /* MS R0 in register file */
} CTEMS_t;


/* CTE Module */
typedef struct CTE_struct
{
    register8_t ADCYCHR;  /* ADC Y-Channel Register */
    register8_t INTCRC;  /* Integrator Control Register C */
    register8_t ADCSRACLR;  /* ADC Status Register A Clear */
    register8_t ADCSRASET;  /* ADC Status Register A Set */
    register8_t INTCRBCLR;  /* Integrator Control Register B Clear */
    register8_t INTCRBSET;  /* Integrator Control Register B Set */
    register8_t INTCRECLR;  /* Integrator Control Register E Clear */
    register8_t INTCRESET;  /* Integrator Control Register E Set */
    register8_t INTXCHR;  /* Integrator X-Channel Register */
    register8_t INTOEN;  /* Integrator Output Enable Register */
    register8_t TIMMOECMP;  /* Integrator Master Output Enable Timer Compare Register */
    register8_t HVCRA;  /* HV Control Register A */
    register8_t TIMAPER;  /* Timer A Period Register */
    register8_t TIMBPER;  /* Timer B Period Register */
    register8_t TIMCPER;  /* Timer C Period Register */
    register8_t TIMMOEPER;  /* Integrator Master Output Enable Timer Period Register */
    register8_t TIMRSTPER;  /* Integrator Reset Timer Period Register */
    register8_t INTDONE;  /* Integrator Done Register */
    register8_t INTTRIGA;  /* Integrator Trigger Register */
    register8_t INTTRIGB;  /* Integrator Trigger Register */
    register8_t INTGAIN0;  /* Integrator Gain 0 */
    register8_t INTGAIN1;  /* Integrator Gain 1 */
    register8_t INTGAIN2;  /* Integrator Gain 2 */
    register8_t INTGAIN3;  /* Integrator Gain 3 */
    register8_t GCAFSRA;  /* GCAF Status Register A */
    register8_t reserved_1[1];
    register8_t GCAFHDLCNT;  /* Headroom Detect Low Counter */
    register8_t GCAFHDHCNT;  /* Headroom Detect High Counter */
    register8_t reserved_2[2];
    register8_t GCAFMCEN;  /* GCAF Multi-Cut Enable */
    register8_t GCAFCCCLIM;  /* GCAF Computation Complete Counter Limit */
    register8_t PIFXPORTA;  /* Port Interface X-lines PORT A */
    register8_t PIFXPORTB;  /* Port Interface X-lines PORT B */
    register8_t PIFYPORT;  /* Port Interface Y-lines PORT */
    register8_t PIFXDDRA;  /* Port Interface X-lines DDR A */
    register8_t PIFXDDRB;  /* Port Interface X-lines DDR B */
    register8_t PIFYDDR;  /* Port Interface Y-lines DDR */
    register8_t PIFXPINA;  /* Port Interface X-lines PIN A */
    register8_t PIFXPINB;  /* Port Interface X-lines PIN B */
    register8_t PIFYPIN;  /* Port Interface Y-lines PIN */
    register8_t PIFXTGLA;  /* Port Interface X-lines Toggle A */
    register8_t PIFXTGLB;  /* Port Interface X-lines Toggle B */
    register8_t PIFYTGL;  /* Port Interface Y-lines Toggle */
    register8_t PIFILA;  /* Port Interface Interleave Register A */
    register8_t PIFILB;  /* Port Interface Interleave Register B */
    register8_t PIFILE;  /* Port Interface Interleave Register Even */
    register8_t PIFILO;  /* Port Interface Interleave Register Odd */
    register8_t reserved_3[16];
    register8_t ADCCRA;  /* ADC Control Register A */
    register8_t ADCCRB;  /* ADC Control Register B */
    register8_t reserved_4[1];
    register8_t ADCINTCAL;  /* ADC and Integrator Calibration Register */
    register8_t ADCRES;  /* ADC Result */
    register8_t ADCINTTEST;  /* ADC and Integrator Test Register */
    register8_t ADCSHVBCAL;  /* ADC and S/H VBias Calibration Register */
    register8_t reserved_5[1];
    register8_t INTCRA;  /* Integrator Control Register A */
    register8_t INTCRD;  /* Integrator Control Register D */
    register8_t INTEN;  /* Integrator Enable Register */
    register8_t INTMASKEN;  /* Integrator Mask Enable Register */
    register8_t SHEN;  /* S/H Enable Register */
    register8_t BIASCR;  /* Bias Control Register */
    register8_t reserved_6[1];
    register8_t HVSEQT;  /* HV Sequence Timing */
    register8_t HDCRA;  /* Headroom Detector Control Register A */
    register8_t HDEN;  /* Headroom Detector Enable Register */
    register8_t HDLOW;  /* Headroom Detector Low Level Output */
    register8_t HDHIGH;  /* Headroom Detector High Level Output */
    register8_t reserved_7[4];
    register8_t GCAFCRA;  /* GCAF Control Register A */
    register8_t GCAFCRB;  /* GCAF Control Register B */
    register8_t reserved_8[1];
    register8_t GCAFBASELIM;  /* GCAF Base Address and Grass Cut Limit */
    register8_t GCAFPCLL;  /* GCAF Pre-Cut Lower Limit */
    register8_t GCAFPCUL;  /* GCAF Pre-Cut Upper Limit */
    register8_t reserved_9[2];
    register8_t PIFXENA;  /* Port Interface X-line Enable A */
    register8_t PIFXENB;  /* Port Interface X-line Enable B */
    register8_t PIFYEN;  /* Port Interface Y-line Enable */
    register8_t PIFXDDRA_SHADOW;  /* Port Interface X-lines DDR A */
    register8_t PIFXDDRB_SHADOW;  /* Port Interface X-lines DDR B */
    register8_t PIFYDDR_SHADOW;  /* Port Interface Y-lines DDR */
    register8_t PIFXSRLA;  /* Port Interface X-line Slew-Rate Limitation A  */
    register8_t PIFXSRLB;  /* Port Interface X-line Slew-Rate Limitation B  */
    register8_t PIFYSRL;  /* Port Interface Y-line Slew-Rate Limitation */
    register8_t reserved_10[23];
    register8_t CTTEMP;  /* CapTouch Temporary Register */
    register8_t CTCRA;  /* CapTouch Control Register A */
    register8_t reserved_11[30];
    CTEMS_t MS0;  /* Micro sequencer 0 control registers */
    register8_t reserved_12[4];
    CTEMS_t MS1;  /* Micro sequencer 1 control registers */
} CTE_t;

/* Interrupt Level */
typedef enum CTE_CTEMS_MSIL_enum
{
    CTE_CTEMS_MSIL_DIS_gc = (0x00<<1),  /* Disabled */
    CTE_CTEMS_MSIL_LOW_gc = (0x01<<1),  /* Low priority */
    CTE_CTEMS_MSIL_MED_gc = (0x02<<1),  /* Medium priority */
    CTE_CTEMS_MSIL_HI_gc = (0x03<<1),  /* High priority */
} CTE_CTEMS_MSIL_t;

/* Timer/Counter Clock Source */
typedef enum CTE_CTEMS_MSTCCS_enum
{
    CTE_CTEMS_MSTCCS_OFF_gc = (0x00<<0),  /* OFF */
    CTE_CTEMS_MSTCCS_OSC_gc = (0x01<<0),  /* f_osc */
    CTE_CTEMS_MSTCCS_OSC_DIV2_gc = (0x02<<0),  /* f_osc/2 */
    CTE_CTEMS_MSTCCS_OSC_DIV4_gc = (0x03<<0),  /* f_osc/4 */
    CTE_CTEMS_MSTCCS_OSC_DIV8_gc = (0x04<<0),  /* f_osc/8 */
    CTE_CTEMS_MSTCCS_OSC_DIV16_gc = (0x05<<0),  /* f_osc/16 */
    CTE_CTEMS_MSTCCS_OSC_DIV32_gc = (0x06<<0),  /* f_osc/32 */
    CTE_CTEMS_MSTCCS_OSC_DIV64_gc = (0x07<<0),  /* f_osc/64 */
    CTE_CTEMS_MSTCCS_OSC_DIV128_gc = (0x08<<0),  /* f_osc/128 */
    CTE_CTEMS_MSTCCS_OSC_DIV256_gc = (0x09<<0),  /* f_osc/256 */
    CTE_CTEMS_MSTCCS_RESERVED_0A_gc = (0x0A<<0),  /* Reserved */
    CTE_CTEMS_MSTCCS_RESERVED_0B_gc = (0x0B<<0),  /* Reserved */
    CTE_CTEMS_MSTCCS_RESERVED_0C_gc = (0x0C<<0),  /* Reserved */
    CTE_CTEMS_MSTCCS_RESERVED_0D_gc = (0x0D<<0),  /* Reserved */
    CTE_CTEMS_MSTCCS_EV0_gc = (0x0E<<0),  /* Event uSequencer 0 */
    CTE_CTEMS_MSTCCS_EV1_gc = (0x0F<<0),  /* Event uSequencer 1 */
} CTE_CTEMS_MSTCCS_t;

/* ADC Reference Voltage */
typedef enum CTE_ADCREFSEL_enum
{
    CTE_ADCREFSEL_1BGR_gc = (0x00<<6),  /* 1V Bandgap Reference */
    CTE_ADCREFSEL_46AV_gc = (0x01<<6),  /* 0.46 * AVcc */
    CTE_ADCREFSEL_50AV_gc = (0x02<<6),  /* 0.50 * AVcc */
    CTE_ADCREFSEL_66AV_gc = (0x03<<6),  /* 0.66 * AVcc */
} CTE_ADCREFSEL_t;

/* Maximum ADC speed */
typedef enum CTE_ADCSPEED_enum
{
    CTE_ADCSPEED_1MPS_gc = (0x00<<0),  /* 1 Msps */
    CTE_ADCSPEED_2MPS_gc = (0x01<<0),  /* 2 Msps */
    CTE_ADCSPEED_3MPS_gc = (0x02<<0),  /* 3 Msps */
    CTE_ADCSPEED_4MPS_gc = (0x03<<0),  /* 4 Msps */
} CTE_ADCSPEED_t;

