gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt336s.h
/* ADC Startup Mode */
typedef enum CTE_ADCSUM_enum
{
    CTE_ADCSUM_ADC1_gc = (0x00<<7),  /* S/H started before ADC to minimize peak current */
    CTE_ADCSUM_ADC2_gc = (0x01<<7),  /* S/H and ADC started in parallel to minimize startup time */
} CTE_ADCSUM_t;

/* GCAF Average Filter Accumulator Mode */
typedef enum CTE_GCAFACCM_enum
{
    CTE_GCAFACCM_DIS_gc = (0x00<<6),  /* Disabled */
    CTE_GCAFACCM_RES_gc = (0x01<<6),  /* Reserved */
    CTE_GCAFACCM_ACC_gc = (0x02<<6),  /* Accumulate always */
    CTE_GCAFACCM_LIM_gc = (0x03<<6),  /* Accumulate only samples which are within the given limits */
} CTE_GCAFACCM_t;

/* GCAF Addressing Mode */
typedef enum CTE_GCAFAM_enum
{
    CTE_GCAFAM_NORM_gc = (0x00<<5),  /* Normal */
    CTE_GCAFAM_XFLIP_gc = (0x01<<5),  /* X flip */
    CTE_GCAFAM_YFLIP_gc = (0x02<<5),  /* Y flip */
    CTE_GCAFAM_XYFLIP_gc = (0x03<<5),  /* X and Y flip */
    CTE_GCAFAM_TRANS_gc = (0x04<<5),  /* Transpose */
    CTE_GCAFAM_XTRANS_gc = (0x05<<5),  /* X flip and transpose */
    CTE_GCAFAM_YTRANS_gc = (0x06<<5),  /* Y flip and transpose */
    CTE_GCAFAM_XYTRANS_gc = (0x07<<5),  /* X and Y flip and transpose */
} CTE_GCAFAM_t;

/* GCAF Median Filter Mode */
typedef enum CTE_GCAFMEDM_enum
{
    CTE_GCAFMEDM_DIS_gc = (0x00<<1),  /* Disabled */
    CTE_GCAFMEDM_MED3_gc = (0x01<<1),  /* Median of 3 samples */
    CTE_GCAFMEDM_MED4P_gc = (0x02<<1),  /* Median of 4 samples and previous median */
    CTE_GCAFMEDM_MED5_gc = (0x03<<1),  /* Median of 5 samples */
    CTE_GCAFMEDM_MED4A_gc = (0x04<<1),  /* Median of 4 samples. Average of two mid samples of four sorted samples. */
    CTE_GCAFMEDM_RES1_gc = (0x05<<1),  /* Reserved1 */
    CTE_GCAFMEDM_RES2_gc = (0x06<<1),  /* Reserved2 */
    CTE_GCAFMEDM_RES3_gc = (0x07<<1),  /* Reserved3 */
} CTE_GCAFMEDM_t;

/* Integrator Gain */
typedef enum CTE_INT0GAIN_enum
{
    CTE_INT0GAIN_INT1_gc = (0x00<<0),  /* 1/64 */
    CTE_INT0GAIN_INT2_gc = (0x01<<0),  /* 1/64 */
    CTE_INT0GAIN_INT3_gc = (0x02<<0),  /* 2/64 */
    CTE_INT0GAIN_INT4_gc = (0x03<<0),  /* 3/64 */
    CTE_INT0GAIN_INT5_gc = (0x04<<0),  /* 4/64 */
    CTE_INT0GAIN_INT6_gc = (0x05<<0),  /* 6/64 */
    CTE_INT0GAIN_INT7_gc = (0x06<<0),  /* 1/8 */
    CTE_INT0GAIN_INT8_gc = (0x07<<0),  /* 1/8+4/64 */
    CTE_INT0GAIN_INT9_gc = (0x08<<0),  /* 2/8 */
    CTE_INT0GAIN_INT10_gc = (0x09<<0),  /* 3/8 */
    CTE_INT0GAIN_INT11_gc = (0x0A<<0),  /* 4/8 */
    CTE_INT0GAIN_INT12_gc = (0x0B<<0),  /* 5/8 */
    CTE_INT0GAIN_INT13_gc = (0x0C<<0),  /* 6/8 */
    CTE_INT0GAIN_INT14_gc = (0x0D<<0),  /* 6/8 */
    CTE_INT0GAIN_INT15_gc = (0x0E<<0),  /* 6/8 */
    CTE_INT0GAIN_INT16_gc = (0x0F<<0),  /* 6/8 */
} CTE_INT0GAIN_t;

/* Integrator Gain */
typedef enum CTE_INT12GAIN_enum
{
    CTE_INT12GAIN_INT1_gc = (0x00<<0),  /* 1/64 */
    CTE_INT12GAIN_INT2_gc = (0x01<<0),  /* 1/64 */
    CTE_INT12GAIN_INT3_gc = (0x02<<0),  /* 2/64 */
    CTE_INT12GAIN_INT4_gc = (0x03<<0),  /* 3/64 */
    CTE_INT12GAIN_INT5_gc = (0x04<<0),  /* 4/64 */
    CTE_INT12GAIN_INT6_gc = (0x05<<0),  /* 6/64 */
    CTE_INT12GAIN_INT7_gc = (0x06<<0),  /* 1/8 */
    CTE_INT12GAIN_INT8_gc = (0x07<<0),  /* 1/8+4/64 */
    CTE_INT12GAIN_INT9_gc = (0x08<<0),  /* 2/8 */
    CTE_INT12GAIN_INT10_gc = (0x09<<0),  /* 3/8 */
    CTE_INT12GAIN_INT11_gc = (0x0A<<0),  /* 4/8 */
    CTE_INT12GAIN_INT12_gc = (0x0B<<0),  /* 5/8 */
    CTE_INT12GAIN_INT13_gc = (0x0C<<0),  /* 6/8 */
    CTE_INT12GAIN_INT14_gc = (0x0D<<0),  /* 6/8 */
    CTE_INT12GAIN_INT15_gc = (0x0E<<0),  /* 6/8 */
    CTE_INT12GAIN_INT16_gc = (0x0F<<0),  /* 6/8 */
} CTE_INT12GAIN_t;

/* Integrator Gain */
typedef enum CTE_INT13GAIN_enum
{
    CTE_INT13GAIN_INT1_gc = (0x00<<4),  /* 1/64 */
    CTE_INT13GAIN_INT2_gc = (0x01<<4),  /* 1/64 */
    CTE_INT13GAIN_INT3_gc = (0x02<<4),  /* 2/64 */
    CTE_INT13GAIN_INT4_gc = (0x03<<4),  /* 3/64 */
    CTE_INT13GAIN_INT5_gc = (0x04<<4),  /* 4/64 */
    CTE_INT13GAIN_INT6_gc = (0x05<<4),  /* 6/64 */
    CTE_INT13GAIN_INT7_gc = (0x06<<4),  /* 1/8 */
    CTE_INT13GAIN_INT8_gc = (0x07<<4),  /* 1/8+4/64 */
    CTE_INT13GAIN_INT9_gc = (0x08<<4),  /* 2/8 */
    CTE_INT13GAIN_INT10_gc = (0x09<<4),  /* 3/8 */
    CTE_INT13GAIN_INT11_gc = (0x0A<<4),  /* 4/8 */
    CTE_INT13GAIN_INT12_gc = (0x0B<<4),  /* 5/8 */
    CTE_INT13GAIN_INT13_gc = (0x0C<<4),  /* 6/8 */
    CTE_INT13GAIN_INT14_gc = (0x0D<<4),  /* 6/8 */
    CTE_INT13GAIN_INT15_gc = (0x0E<<4),  /* 6/8 */
    CTE_INT13GAIN_INT16_gc = (0x0F<<4),  /* 6/8 */
} CTE_INT13GAIN_t;

/* Integrator Gain */
typedef enum CTE_INT1GAIN_enum
{
    CTE_INT1GAIN_INT1_gc = (0x00<<4),  /* 1/64 */
    CTE_INT1GAIN_INT2_gc = (0x01<<4),  /* 1/64 */
    CTE_INT1GAIN_INT3_gc = (0x02<<4),  /* 2/64 */
    CTE_INT1GAIN_INT4_gc = (0x03<<4),  /* 3/64 */
    CTE_INT1GAIN_INT5_gc = (0x04<<4),  /* 4/64 */
    CTE_INT1GAIN_INT6_gc = (0x05<<4),  /* 6/64 */
    CTE_INT1GAIN_INT7_gc = (0x06<<4),  /* 1/8 */
    CTE_INT1GAIN_INT8_gc = (0x07<<4),  /* 1/8+4/64 */
    CTE_INT1GAIN_INT9_gc = (0x08<<4),  /* 2/8 */
    CTE_INT1GAIN_INT10_gc = (0x09<<4),  /* 3/8 */
    CTE_INT1GAIN_INT11_gc = (0x0A<<4),  /* 4/8 */
    CTE_INT1GAIN_INT12_gc = (0x0B<<4),  /* 5/8 */
    CTE_INT1GAIN_INT13_gc = (0x0C<<4),  /* 6/8 */
    CTE_INT1GAIN_INT14_gc = (0x0D<<4),  /* 6/8 */
    CTE_INT1GAIN_INT15_gc = (0x0E<<4),  /* 6/8 */
    CTE_INT1GAIN_INT16_gc = (0x0F<<4),  /* 6/8 */
} CTE_INT1GAIN_t;

/* Integrator Gain */
typedef enum CTE_INT4GAIN_enum
{
    CTE_INT4GAIN_INT1_gc = (0x00<<0),  /* 1/64 */
    CTE_INT4GAIN_INT2_gc = (0x01<<0),  /* 1/64 */
    CTE_INT4GAIN_INT3_gc = (0x02<<0),  /* 2/64 */
    CTE_INT4GAIN_INT4_gc = (0x03<<0),  /* 3/64 */
    CTE_INT4GAIN_INT5_gc = (0x04<<0),  /* 4/64 */
    CTE_INT4GAIN_INT6_gc = (0x05<<0),  /* 6/64 */
    CTE_INT4GAIN_INT7_gc = (0x06<<0),  /* 1/8 */
    CTE_INT4GAIN_INT8_gc = (0x07<<0),  /* 1/8+4/64 */
    CTE_INT4GAIN_INT9_gc = (0x08<<0),  /* 2/8 */
    CTE_INT4GAIN_INT10_gc = (0x09<<0),  /* 3/8 */
    CTE_INT4GAIN_INT11_gc = (0x0A<<0),  /* 4/8 */
    CTE_INT4GAIN_INT12_gc = (0x0B<<0),  /* 5/8 */
    CTE_INT4GAIN_INT13_gc = (0x0C<<0),  /* 6/8 */
    CTE_INT4GAIN_INT14_gc = (0x0D<<0),  /* 6/8 */
    CTE_INT4GAIN_INT15_gc = (0x0E<<0),  /* 6/8 */
    CTE_INT4GAIN_INT16_gc = (0x0F<<0),  /* 6/8 */
} CTE_INT4GAIN_t;

/* Integrator Gain */
typedef enum CTE_INT5GAIN_enum
{
    CTE_INT5GAIN_INT1_gc = (0x00<<4),  /* 1/64 */
    CTE_INT5GAIN_INT2_gc = (0x01<<4),  /* 1/64 */
    CTE_INT5GAIN_INT3_gc = (0x02<<4),  /* 2/64 */
    CTE_INT5GAIN_INT4_gc = (0x03<<4),  /* 3/64 */
    CTE_INT5GAIN_INT5_gc = (0x04<<4),  /* 4/64 */
    CTE_INT5GAIN_INT6_gc = (0x05<<4),  /* 6/64 */
    CTE_INT5GAIN_INT7_gc = (0x06<<4),  /* 1/8 */
    CTE_INT5GAIN_INT8_gc = (0x07<<4),  /* 1/8+4/64 */
    CTE_INT5GAIN_INT9_gc = (0x08<<4),  /* 2/8 */
    CTE_INT5GAIN_INT10_gc = (0x09<<4),  /* 3/8 */
    CTE_INT5GAIN_INT11_gc = (0x0A<<4),  /* 4/8 */
    CTE_INT5GAIN_INT12_gc = (0x0B<<4),  /* 5/8 */
    CTE_INT5GAIN_INT13_gc = (0x0C<<4),  /* 6/8 */
    CTE_INT5GAIN_INT14_gc = (0x0D<<4),  /* 6/8 */
    CTE_INT5GAIN_INT15_gc = (0x0E<<4),  /* 6/8 */
    CTE_INT5GAIN_INT16_gc = (0x0F<<4),  /* 6/8 */
} CTE_INT5GAIN_t;

/* Integrator Gain */
typedef enum CTE_INT8GAIN_enum
{
    CTE_INT8GAIN_INT1_gc = (0x00<<0),  /* 1/64 */
    CTE_INT8GAIN_INT2_gc = (0x01<<0),  /* 1/64 */
    CTE_INT8GAIN_INT3_gc = (0x02<<0),  /* 2/64 */
    CTE_INT8GAIN_INT4_gc = (0x03<<0),  /* 3/64 */
    CTE_INT8GAIN_INT5_gc = (0x04<<0),  /* 4/64 */
    CTE_INT8GAIN_INT6_gc = (0x05<<0),  /* 6/64 */
    CTE_INT8GAIN_INT7_gc = (0x06<<0),  /* 1/8 */
    CTE_INT8GAIN_INT8_gc = (0x07<<0),  /* 1/8+4/64 */
    CTE_INT8GAIN_INT9_gc = (0x08<<0),  /* 2/8 */
    CTE_INT8GAIN_INT10_gc = (0x09<<0),  /* 3/8 */
    CTE_INT8GAIN_INT11_gc = (0x0A<<0),  /* 4/8 */
    CTE_INT8GAIN_INT12_gc = (0x0B<<0),  /* 5/8 */
    CTE_INT8GAIN_INT13_gc = (0x0C<<0),  /* 6/8 */
    CTE_INT8GAIN_INT14_gc = (0x0D<<0),  /* 6/8 */
    CTE_INT8GAIN_INT15_gc = (0x0E<<0),  /* 6/8 */
    CTE_INT8GAIN_INT16_gc = (0x0F<<0),  /* 6/8 */
} CTE_INT8GAIN_t;

/* Integrator Gain */
typedef enum CTE_INT9GAIN_enum
{
    CTE_INT9GAIN_INT1_gc = (0x00<<4),  /* 1/64 */
    CTE_INT9GAIN_INT2_gc = (0x01<<4),  /* 1/64 */
    CTE_INT9GAIN_INT3_gc = (0x02<<4),  /* 2/64 */
    CTE_INT9GAIN_INT4_gc = (0x03<<4),  /* 3/64 */
    CTE_INT9GAIN_INT5_gc = (0x04<<4),  /* 4/64 */
    CTE_INT9GAIN_INT6_gc = (0x05<<4),  /* 6/64 */
    CTE_INT9GAIN_INT7_gc = (0x06<<4),  /* 1/8 */
    CTE_INT9GAIN_INT8_gc = (0x07<<4),  /* 1/8+4/64 */
    CTE_INT9GAIN_INT9_gc = (0x08<<4),  /* 2/8 */
    CTE_INT9GAIN_INT10_gc = (0x09<<4),  /* 3/8 */
    CTE_INT9GAIN_INT11_gc = (0x0A<<4),  /* 4/8 */
    CTE_INT9GAIN_INT12_gc = (0x0B<<4),  /* 5/8 */
    CTE_INT9GAIN_INT13_gc = (0x0C<<4),  /* 6/8 */
    CTE_INT9GAIN_INT14_gc = (0x0D<<4),  /* 6/8 */
    CTE_INT9GAIN_INT15_gc = (0x0E<<4),  /* 6/8 */
    CTE_INT9GAIN_INT16_gc = (0x0F<<4),  /* 6/8 */
} CTE_INT9GAIN_t;

