gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt336s.h
/* CTEMS.MSSRD  bit masks and bit positions */
/* CTEMS_MSTCUNF  is already defined. */
/* CTEMS_MSHSF  is already defined. */
#define CTEMS_GCAFCCCWL_bm  0x20  /* GCAF Computation Counter Within Limits bit mask. */
#define CTEMS_GCAFCCCWL_bp  5  /* GCAF Computation Counter Within Limits bit position. */
#define CTEMS_GCAFIDLE_bm  0x40  /* GCAF Idle bit mask. */
#define CTEMS_GCAFIDLE_bp  6  /* GCAF Idle bit position. */

/* CTEMS.MSCCR  bit masks and bit positions */
#define CTEMS_ZB_bm  0x01  /* Zero Byte bit mask. */
#define CTEMS_ZB_bp  0  /* Zero Byte bit position. */
#define CTEMS_CB_bm  0x02  /* Carry Byte bit mask. */
#define CTEMS_CB_bp  1  /* Carry Byte bit position. */
#define CTEMS_SB_bm  0x04  /* Signed Byte bit mask. */
#define CTEMS_SB_bp  2  /* Signed Byte bit position. */
#define CTEMS_ZW_bm  0x08  /* Zero Word bit mask. */
#define CTEMS_ZW_bp  3  /* Zero Word bit position. */
#define CTEMS_CW_bm  0x10  /* Carry Word bit mask. */
#define CTEMS_CW_bp  4  /* Carry Word bit position. */
#define CTEMS_SW_bm  0x20  /* Signed Word bit mask. */
#define CTEMS_SW_bp  5  /* Signed Word bit position. */
#define CTEMS_T_gm  0xC0  /* Temporary flags group mask. */
#define CTEMS_T_gp  6  /* Temporary flags group position. */
#define CTEMS_T0_bm  (1<<6)  /* Temporary flags bit 0 mask. */
#define CTEMS_T0_bp  6  /* Temporary flags bit 0 position. */
#define CTEMS_T1_bm  (1<<7)  /* Temporary flags bit 1 mask. */
#define CTEMS_T1_bp  7  /* Temporary flags bit 1 position. */



/* CTEMS.MSHIF  bit masks and bit positions */
#define CTEMS_MSRUN_bm  0x01  /* MS Run bit mask. */
#define CTEMS_MSRUN_bp  0  /* MS Run bit position. */
#define CTEMS_MSSS_bm  0x02  /* MS Single Step bit mask. */
#define CTEMS_MSSS_bp  1  /* MS Single Step bit position. */
#define CTEMS_MSIF_bm  0x04  /* MS Interrupt Flag bit mask. */
#define CTEMS_MSIF_bp  2  /* MS Interrupt Flag bit position. */







/* CTE.ADCYCHR  bit masks and bit positions */
#define CTE_ADCYCH_gm  0x0F  /* ADC Y-Channel group mask. */
#define CTE_ADCYCH_gp  0  /* ADC Y-Channel group position. */
#define CTE_ADCYCH0_bm  (1<<0)  /* ADC Y-Channel bit 0 mask. */
#define CTE_ADCYCH0_bp  0  /* ADC Y-Channel bit 0 position. */
#define CTE_ADCYCH1_bm  (1<<1)  /* ADC Y-Channel bit 1 mask. */
#define CTE_ADCYCH1_bp  1  /* ADC Y-Channel bit 1 position. */
#define CTE_ADCYCH2_bm  (1<<2)  /* ADC Y-Channel bit 2 mask. */
#define CTE_ADCYCH2_bp  2  /* ADC Y-Channel bit 2 position. */
#define CTE_ADCYCH3_bm  (1<<3)  /* ADC Y-Channel bit 3 mask. */
#define CTE_ADCYCH3_bp  3  /* ADC Y-Channel bit 3 position. */
#define CTE_ADCSC_bm  0x10  /* ADC Single Channel Conversion bit mask. */
#define CTE_ADCSC_bp  4  /* ADC Single Channel Conversion bit position. */
#define CTE_ADCAUX_bm  0x20  /* ADC Auxiliary Channel Select bit mask. */
#define CTE_ADCAUX_bp  5  /* ADC Auxiliary Channel Select bit position. */

/* CTE.INTCRC  bit masks and bit positions */
#define CTE_INTRSTLVL_gm  0x07  /* Integrator Reset Level group mask. */
#define CTE_INTRSTLVL_gp  0  /* Integrator Reset Level group position. */
#define CTE_INTRSTLVL0_bm  (1<<0)  /* Integrator Reset Level bit 0 mask. */
#define CTE_INTRSTLVL0_bp  0  /* Integrator Reset Level bit 0 position. */
#define CTE_INTRSTLVL1_bm  (1<<1)  /* Integrator Reset Level bit 1 mask. */
#define CTE_INTRSTLVL1_bp  1  /* Integrator Reset Level bit 1 position. */
#define CTE_INTRSTLVL2_bm  (1<<2)  /* Integrator Reset Level bit 2 mask. */
#define CTE_INTRSTLVL2_bp  2  /* Integrator Reset Level bit 2 position. */

/* CTE.ADCSRACLR  bit masks and bit positions */
#define CTE_ADCLC_bm  0x01  /* ADC Last Conversion Result bit mask. */
#define CTE_ADCLC_bp  0  /* ADC Last Conversion Result bit position. */
#define CTE_ADCLCX_bm  0x02  /* ADC Last Conversion Result in X-line bit mask. */
#define CTE_ADCLCX_bp  1  /* ADC Last Conversion Result in X-line bit position. */
#define CTE_ADCVC_bm  0x04  /* ADC Valid Conversion Result bit mask. */
#define CTE_ADCVC_bp  2  /* ADC Valid Conversion Result bit position. */
#define CTE_ADCPS_bm  0x08  /* ADC Power Save bit mask. */
#define CTE_ADCPS_bp  3  /* ADC Power Save bit position. */
#define CTE_ADCBUSY_bm  0x10  /* ADC Busy bit mask. */
#define CTE_ADCBUSY_bp  4  /* ADC Busy bit position. */
#define CTE_ADCPIPEBUSY_bm  0x20  /* ADC Pipeline Busy bit mask. */
#define CTE_ADCPIPEBUSY_bp  5  /* ADC Pipeline Busy bit position. */
#define CTE_ADCANAPIPEBUSY_bm  0x40  /* ADC Analog Pipeline Busy bit mask. */
#define CTE_ADCANAPIPEBUSY_bp  6  /* ADC Analog Pipeline Busy bit position. */

/* CTE.ADCSRASET  bit masks and bit positions */
/* CTE_ADCLC  is already defined. */
/* CTE_ADCLCX  is already defined. */
/* CTE_ADCVC  is already defined. */
/* CTE_ADCPS  is already defined. */
/* CTE_ADCBUSY  is already defined. */
/* CTE_ADCPIPEBUSY  is already defined. */
/* CTE_ADCANAPIPEBUSY  is already defined. */

/* CTE.INTCRBCLR  bit masks and bit positions */
#define CTE_INTSIGN_bm  0x01  /* Integrator Sign bit mask. */
#define CTE_INTSIGN_bp  0  /* Integrator Sign bit position. */
#define CTE_TIMA_bm  0x02  /* Timer A Output bit mask. */
#define CTE_TIMA_bp  1  /* Timer A Output bit position. */
#define CTE_TIMB_bm  0x04  /* Timer B Output bit mask. */
#define CTE_TIMB_bp  2  /* Timer B Output bit position. */
#define CTE_TIMC_bm  0x08  /* Timer C Output bit mask. */
#define CTE_TIMC_bp  3  /* Timer C Output bit position. */
#define CTE_INTMOE_bm  0x10  /* Integrator Master Output Enable bit mask. */
#define CTE_INTMOE_bp  4  /* Integrator Master Output Enable bit position. */
#define CTE_INTRST_bm  0x20  /* Integrator Reset bit mask. */
#define CTE_INTRST_bp  5  /* Integrator Reset bit position. */
#define CTE_SHADC_bm  0x40  /* S/H and ADC Pending bit mask. */
#define CTE_SHADC_bp  6  /* S/H and ADC Pending bit position. */
#define CTE_INTID_bm  0x80  /* Integrator input disable bit mask. */
#define CTE_INTID_bp  7  /* Integrator input disable bit position. */

/* CTE.INTCRBSET  bit masks and bit positions */
/* CTE_INTSIGN  is already defined. */
/* CTE_TIMA  is already defined. */
/* CTE_TIMB  is already defined. */
/* CTE_TIMC  is already defined. */
/* CTE_INTMOE  is already defined. */
/* CTE_INTRST  is already defined. */
/* CTE_SHADC  is already defined. */
/* CTE_INTID  is already defined. */

/* CTE.INTCRECLR  bit masks and bit positions */
#define CTE_INTYONX_gm  0x03  /* Integrator Y on X group mask. */
#define CTE_INTYONX_gp  0  /* Integrator Y on X group position. */
#define CTE_INTYONX0_bm  (1<<0)  /* Integrator Y on X bit 0 mask. */
#define CTE_INTYONX0_bp  0  /* Integrator Y on X bit 0 position. */
#define CTE_INTYONX1_bm  (1<<1)  /* Integrator Y on X bit 1 mask. */
#define CTE_INTYONX1_bp  1  /* Integrator Y on X bit 1 position. */
#define CTE_INTBYPASSX_bm  0x04  /* Integrator Bypass X-line bit mask. */
#define CTE_INTBYPASSX_bp  2  /* Integrator Bypass X-line bit position. */
#define CTE_INTBYPASSY_bm  0x08  /* Integrator Bypass Y-line bit mask. */
#define CTE_INTBYPASSY_bp  3  /* Integrator Bypass Y-line bit position. */
#define CTE_INTDIBUFX_bm  0x10  /* Integrator Dummy Input Buffer connect to X-line bit mask. */
#define CTE_INTDIBUFX_bp  4  /* Integrator Dummy Input Buffer connect to X-line bit position. */
#define CTE_INTSCCSNEN_bm  0x20  /* Integrator Selfcap NMOS Current Source Enable bit mask. */
#define CTE_INTSCCSNEN_bp  5  /* Integrator Selfcap NMOS Current Source Enable bit position. */
#define CTE_INTSCCSPEN_bm  0x40  /* Integrator Selfcap PMOS Current Source Enable bit mask. */
#define CTE_INTSCCSPEN_bp  6  /* Integrator Selfcap PMOS Current Source Enable bit position. */
#define CTE_INTSCPROX_bm  0x80  /* Integrator Selfcap Proximity Mode bit mask. */
#define CTE_INTSCPROX_bp  7  /* Integrator Selfcap Proximity Mode bit position. */

/* CTE.INTCRESET  bit masks and bit positions */
/* CTE_INTYONX  is already defined. */
/* CTE_INTBYPASSX  is already defined. */
/* CTE_INTBYPASSY  is already defined. */
/* CTE_INTDIBUFX  is already defined. */
/* CTE_INTSCCSNEN  is already defined. */
/* CTE_INTSCCSPEN  is already defined. */
/* CTE_INTSCPROX  is already defined. */

/* CTE.INTXCHR  bit masks and bit positions */
#define CTE_INTXCH_gm  0x3F  /* Integrator X-Channel group mask. */
#define CTE_INTXCH_gp  0  /* Integrator X-Channel group position. */
#define CTE_INTXCH0_bm  (1<<0)  /* Integrator X-Channel bit 0 mask. */
#define CTE_INTXCH0_bp  0  /* Integrator X-Channel bit 0 position. */
#define CTE_INTXCH1_bm  (1<<1)  /* Integrator X-Channel bit 1 mask. */
#define CTE_INTXCH1_bp  1  /* Integrator X-Channel bit 1 position. */
#define CTE_INTXCH2_bm  (1<<2)  /* Integrator X-Channel bit 2 mask. */
#define CTE_INTXCH2_bp  2  /* Integrator X-Channel bit 2 position. */
#define CTE_INTXCH3_bm  (1<<3)  /* Integrator X-Channel bit 3 mask. */
#define CTE_INTXCH3_bp  3  /* Integrator X-Channel bit 3 position. */
#define CTE_INTXCH4_bm  (1<<4)  /* Integrator X-Channel bit 4 mask. */
#define CTE_INTXCH4_bp  4  /* Integrator X-Channel bit 4 position. */
#define CTE_INTXCH5_bm  (1<<5)  /* Integrator X-Channel bit 5 mask. */
#define CTE_INTXCH5_bp  5  /* Integrator X-Channel bit 5 position. */

/* CTE.INTOEN  bit masks and bit positions */
#define CTE_INTOEN_7_0_gm  0xFF  /* Integrator X-Channel Output Enable group mask. */
#define CTE_INTOEN_7_0_gp  0  /* Integrator X-Channel Output Enable group position. */
#define CTE_INTOEN_7_00_bm  (1<<0)  /* Integrator X-Channel Output Enable bit 0 mask. */
#define CTE_INTOEN_7_00_bp  0  /* Integrator X-Channel Output Enable bit 0 position. */
#define CTE_INTOEN_7_01_bm  (1<<1)  /* Integrator X-Channel Output Enable bit 1 mask. */
#define CTE_INTOEN_7_01_bp  1  /* Integrator X-Channel Output Enable bit 1 position. */
#define CTE_INTOEN_7_02_bm  (1<<2)  /* Integrator X-Channel Output Enable bit 2 mask. */
#define CTE_INTOEN_7_02_bp  2  /* Integrator X-Channel Output Enable bit 2 position. */
#define CTE_INTOEN_7_03_bm  (1<<3)  /* Integrator X-Channel Output Enable bit 3 mask. */
#define CTE_INTOEN_7_03_bp  3  /* Integrator X-Channel Output Enable bit 3 position. */
#define CTE_INTOEN_7_04_bm  (1<<4)  /* Integrator X-Channel Output Enable bit 4 mask. */
#define CTE_INTOEN_7_04_bp  4  /* Integrator X-Channel Output Enable bit 4 position. */
#define CTE_INTOEN_7_05_bm  (1<<5)  /* Integrator X-Channel Output Enable bit 5 mask. */
#define CTE_INTOEN_7_05_bp  5  /* Integrator X-Channel Output Enable bit 5 position. */
#define CTE_INTOEN_7_06_bm  (1<<6)  /* Integrator X-Channel Output Enable bit 6 mask. */
#define CTE_INTOEN_7_06_bp  6  /* Integrator X-Channel Output Enable bit 6 position. */
#define CTE_INTOEN_7_07_bm  (1<<7)  /* Integrator X-Channel Output Enable bit 7 mask. */
#define CTE_INTOEN_7_07_bp  7  /* Integrator X-Channel Output Enable bit 7 position. */

