gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt336s.h
/* CTE.INTDONE  bit masks and bit positions */
#define CTE_TIMADONE_bm  0x02  /* Timer A Done bit mask. */
#define CTE_TIMADONE_bp  1  /* Timer A Done bit position. */
#define CTE_TIMBDONE_bm  0x04  /* Timer B Done bit mask. */
#define CTE_TIMBDONE_bp  2  /* Timer B Done bit position. */
#define CTE_TIMCDONE_bm  0x08  /* Timer C Done bit mask. */
#define CTE_TIMCDONE_bp  3  /* Timer C Done bit position. */
#define CTE_INTMOEDONE_bm  0x10  /* Integrator Master Output Enable Time Done bit mask. */
#define CTE_INTMOEDONE_bp  4  /* Integrator Master Output Enable Time Done bit position. */
#define CTE_INTRSTDONE_bm  0x20  /* Integrator Reset Timer Done bit mask. */
#define CTE_INTRSTDONE_bp  5  /* Integrator Reset Timer Done bit position. */
#define CTE_SHADCDONE_bm  0x40  /* S/H and ADC Inverted Trigger bit mask. */
#define CTE_SHADCDONE_bp  6  /* S/H and ADC Inverted Trigger bit position. */
#define CTE_ALLDONE_bm  0x80  /* All Timers Done bit mask. */
#define CTE_ALLDONE_bp  7  /* All Timers Done bit position. */

/* CTE.INTTRIGA  bit masks and bit positions */
#define CTE_INTPORTTGL_bm  0x01  /* Integrator Port Toggle bit mask. */
#define CTE_INTPORTTGL_bp  0  /* Integrator Port Toggle bit position. */
#define CTE_TIMATRIG_bm  0x02  /* Timer A Trigger bit mask. */
#define CTE_TIMATRIG_bp  1  /* Timer A Trigger bit position. */
#define CTE_TIMBTRIG_bm  0x04  /* Timer B Trigger bit mask. */
#define CTE_TIMBTRIG_bp  2  /* Timer B Trigger bit position. */
#define CTE_TIMCTRIG_bm  0x08  /* Timer C Trigger bit mask. */
#define CTE_TIMCTRIG_bp  3  /* Timer C Trigger bit position. */
#define CTE_INTMOETRIG_bm  0x10  /* Integrator Master Output Enable Trigger bit mask. */
#define CTE_INTMOETRIG_bp  4  /* Integrator Master Output Enable Trigger bit position. */
#define CTE_INTRSTTRIG_bm  0x20  /* Integrator Reset Trigger bit mask. */
#define CTE_INTRSTTRIG_bp  5  /* Integrator Reset Trigger bit position. */
#define CTE_SHADCTRIG_bm  0x40  /* S/H and ADC Trigger bit mask. */
#define CTE_SHADCTRIG_bp  6  /* S/H and ADC Trigger bit position. */
#define CTE_INTXRDY_bm  0x80  /* Integrator X-line Ready bit mask. */
#define CTE_INTXRDY_bp  7  /* Integrator X-line Ready bit position. */

/* CTE.INTTRIGB  bit masks and bit positions */
/* CTE_INTPORTTGL  is already defined. */
/* CTE_TIMATRIG  is already defined. */
/* CTE_TIMBTRIG  is already defined. */
/* CTE_TIMCTRIG  is already defined. */
/* CTE_INTMOETRIG  is already defined. */
/* CTE_INTRSTTRIG  is already defined. */
#define CTE_HVSEQXLTRIG_bm  0x40  /* High Voltage Sequencer X-Line Trigger bit mask. */
#define CTE_HVSEQXLTRIG_bp  6  /* High Voltage Sequencer X-Line Trigger bit position. */
#define CTE_SRCAPRST_bm  0x80  /* Slew Rate Capacitor Reset bit mask. */
#define CTE_SRCAPRST_bp  7  /* Slew Rate Capacitor Reset bit position. */

/* CTE.INTGAIN0  bit masks and bit positions */
#define CTE_INT0GAIN_gm  0x0F  /* Integrator 0 Gain group mask. */
#define CTE_INT0GAIN_gp  0  /* Integrator 0 Gain group position. */
#define CTE_INT0GAIN0_bm  (1<<0)  /* Integrator 0 Gain bit 0 mask. */
#define CTE_INT0GAIN0_bp  0  /* Integrator 0 Gain bit 0 position. */
#define CTE_INT0GAIN1_bm  (1<<1)  /* Integrator 0 Gain bit 1 mask. */
#define CTE_INT0GAIN1_bp  1  /* Integrator 0 Gain bit 1 position. */
#define CTE_INT0GAIN2_bm  (1<<2)  /* Integrator 0 Gain bit 2 mask. */
#define CTE_INT0GAIN2_bp  2  /* Integrator 0 Gain bit 2 position. */
#define CTE_INT0GAIN3_bm  (1<<3)  /* Integrator 0 Gain bit 3 mask. */
#define CTE_INT0GAIN3_bp  3  /* Integrator 0 Gain bit 3 position. */
#define CTE_INT1GAIN_gm  0xF0  /* Integrator 1 Gain group mask. */
#define CTE_INT1GAIN_gp  4  /* Integrator 1 Gain group position. */
#define CTE_INT1GAIN0_bm  (1<<4)  /* Integrator 1 Gain bit 0 mask. */
#define CTE_INT1GAIN0_bp  4  /* Integrator 1 Gain bit 0 position. */
#define CTE_INT1GAIN1_bm  (1<<5)  /* Integrator 1 Gain bit 1 mask. */
#define CTE_INT1GAIN1_bp  5  /* Integrator 1 Gain bit 1 position. */
#define CTE_INT1GAIN2_bm  (1<<6)  /* Integrator 1 Gain bit 2 mask. */
#define CTE_INT1GAIN2_bp  6  /* Integrator 1 Gain bit 2 position. */
#define CTE_INT1GAIN3_bm  (1<<7)  /* Integrator 1 Gain bit 3 mask. */
#define CTE_INT1GAIN3_bp  7  /* Integrator 1 Gain bit 3 position. */

/* CTE.INTGAIN1  bit masks and bit positions */
#define CTE_INT4GAIN_gm  0x0F  /* Integrator 4 Gain group mask. */
#define CTE_INT4GAIN_gp  0  /* Integrator 4 Gain group position. */
#define CTE_INT4GAIN0_bm  (1<<0)  /* Integrator 4 Gain bit 0 mask. */
#define CTE_INT4GAIN0_bp  0  /* Integrator 4 Gain bit 0 position. */
#define CTE_INT4GAIN1_bm  (1<<1)  /* Integrator 4 Gain bit 1 mask. */
#define CTE_INT4GAIN1_bp  1  /* Integrator 4 Gain bit 1 position. */
#define CTE_INT4GAIN2_bm  (1<<2)  /* Integrator 4 Gain bit 2 mask. */
#define CTE_INT4GAIN2_bp  2  /* Integrator 4 Gain bit 2 position. */
#define CTE_INT4GAIN3_bm  (1<<3)  /* Integrator 4 Gain bit 3 mask. */
#define CTE_INT4GAIN3_bp  3  /* Integrator 4 Gain bit 3 position. */
#define CTE_INT5GAIN_gm  0xF0  /* Integrator 5 Gain group mask. */
#define CTE_INT5GAIN_gp  4  /* Integrator 5 Gain group position. */
#define CTE_INT5GAIN0_bm  (1<<4)  /* Integrator 5 Gain bit 0 mask. */
#define CTE_INT5GAIN0_bp  4  /* Integrator 5 Gain bit 0 position. */
#define CTE_INT5GAIN1_bm  (1<<5)  /* Integrator 5 Gain bit 1 mask. */
#define CTE_INT5GAIN1_bp  5  /* Integrator 5 Gain bit 1 position. */
#define CTE_INT5GAIN2_bm  (1<<6)  /* Integrator 5 Gain bit 2 mask. */
#define CTE_INT5GAIN2_bp  6  /* Integrator 5 Gain bit 2 position. */
#define CTE_INT5GAIN3_bm  (1<<7)  /* Integrator 5 Gain bit 3 mask. */
#define CTE_INT5GAIN3_bp  7  /* Integrator 5 Gain bit 3 position. */

/* CTE.INTGAIN2  bit masks and bit positions */
#define CTE_INT8GAIN_gm  0x0F  /* Integrator 8 Gain group mask. */
#define CTE_INT8GAIN_gp  0  /* Integrator 8 Gain group position. */
#define CTE_INT8GAIN0_bm  (1<<0)  /* Integrator 8 Gain bit 0 mask. */
#define CTE_INT8GAIN0_bp  0  /* Integrator 8 Gain bit 0 position. */
#define CTE_INT8GAIN1_bm  (1<<1)  /* Integrator 8 Gain bit 1 mask. */
#define CTE_INT8GAIN1_bp  1  /* Integrator 8 Gain bit 1 position. */
#define CTE_INT8GAIN2_bm  (1<<2)  /* Integrator 8 Gain bit 2 mask. */
#define CTE_INT8GAIN2_bp  2  /* Integrator 8 Gain bit 2 position. */
#define CTE_INT8GAIN3_bm  (1<<3)  /* Integrator 8 Gain bit 3 mask. */
#define CTE_INT8GAIN3_bp  3  /* Integrator 8 Gain bit 3 position. */
#define CTE_INT9GAIN_gm  0xF0  /* Integrator 9 Gain group mask. */
#define CTE_INT9GAIN_gp  4  /* Integrator 9 Gain group position. */
#define CTE_INT9GAIN0_bm  (1<<4)  /* Integrator 9 Gain bit 0 mask. */
#define CTE_INT9GAIN0_bp  4  /* Integrator 9 Gain bit 0 position. */
#define CTE_INT9GAIN1_bm  (1<<5)  /* Integrator 9 Gain bit 1 mask. */
#define CTE_INT9GAIN1_bp  5  /* Integrator 9 Gain bit 1 position. */
#define CTE_INT9GAIN2_bm  (1<<6)  /* Integrator 9 Gain bit 2 mask. */
#define CTE_INT9GAIN2_bp  6  /* Integrator 9 Gain bit 2 position. */
#define CTE_INT9GAIN3_bm  (1<<7)  /* Integrator 9 Gain bit 3 mask. */
#define CTE_INT9GAIN3_bp  7  /* Integrator 9 Gain bit 3 position. */

/* CTE.INTGAIN3  bit masks and bit positions */
#define CTE_INT12GAIN_gm  0x0F  /* Integrator 12 Gain group mask. */
#define CTE_INT12GAIN_gp  0  /* Integrator 12 Gain group position. */
#define CTE_INT12GAIN0_bm  (1<<0)  /* Integrator 12 Gain bit 0 mask. */
#define CTE_INT12GAIN0_bp  0  /* Integrator 12 Gain bit 0 position. */
#define CTE_INT12GAIN1_bm  (1<<1)  /* Integrator 12 Gain bit 1 mask. */
#define CTE_INT12GAIN1_bp  1  /* Integrator 12 Gain bit 1 position. */
#define CTE_INT12GAIN2_bm  (1<<2)  /* Integrator 12 Gain bit 2 mask. */
#define CTE_INT12GAIN2_bp  2  /* Integrator 12 Gain bit 2 position. */
#define CTE_INT12GAIN3_bm  (1<<3)  /* Integrator 12 Gain bit 3 mask. */
#define CTE_INT12GAIN3_bp  3  /* Integrator 12 Gain bit 3 position. */
#define CTE_INT13GAIN_gm  0xF0  /* Integrator 13 Gain group mask. */
#define CTE_INT13GAIN_gp  4  /* Integrator 13 Gain group position. */
#define CTE_INT13GAIN0_bm  (1<<4)  /* Integrator 13 Gain bit 0 mask. */
#define CTE_INT13GAIN0_bp  4  /* Integrator 13 Gain bit 0 position. */
#define CTE_INT13GAIN1_bm  (1<<5)  /* Integrator 13 Gain bit 1 mask. */
#define CTE_INT13GAIN1_bp  5  /* Integrator 13 Gain bit 1 position. */
#define CTE_INT13GAIN2_bm  (1<<6)  /* Integrator 13 Gain bit 2 mask. */
#define CTE_INT13GAIN2_bp  6  /* Integrator 13 Gain bit 2 position. */
#define CTE_INT13GAIN3_bm  (1<<7)  /* Integrator 13 Gain bit 3 mask. */
#define CTE_INT13GAIN3_bp  7  /* Integrator 13 Gain bit 3 position. */

/* CTE.GCAFSRA  bit masks and bit positions */
#define CTE_GCAFCCC_gm  0x7F  /* GCAF Computation Complete Counter group mask. */
#define CTE_GCAFCCC_gp  0  /* GCAF Computation Complete Counter group position. */
#define CTE_GCAFCCC0_bm  (1<<0)  /* GCAF Computation Complete Counter bit 0 mask. */
#define CTE_GCAFCCC0_bp  0  /* GCAF Computation Complete Counter bit 0 position. */
#define CTE_GCAFCCC1_bm  (1<<1)  /* GCAF Computation Complete Counter bit 1 mask. */
#define CTE_GCAFCCC1_bp  1  /* GCAF Computation Complete Counter bit 1 position. */
#define CTE_GCAFCCC2_bm  (1<<2)  /* GCAF Computation Complete Counter bit 2 mask. */
#define CTE_GCAFCCC2_bp  2  /* GCAF Computation Complete Counter bit 2 position. */
#define CTE_GCAFCCC3_bm  (1<<3)  /* GCAF Computation Complete Counter bit 3 mask. */
#define CTE_GCAFCCC3_bp  3  /* GCAF Computation Complete Counter bit 3 position. */
#define CTE_GCAFCCC4_bm  (1<<4)  /* GCAF Computation Complete Counter bit 4 mask. */
#define CTE_GCAFCCC4_bp  4  /* GCAF Computation Complete Counter bit 4 position. */
#define CTE_GCAFCCC5_bm  (1<<5)  /* GCAF Computation Complete Counter bit 5 mask. */
#define CTE_GCAFCCC5_bp  5  /* GCAF Computation Complete Counter bit 5 position. */
#define CTE_GCAFCCC6_bm  (1<<6)  /* GCAF Computation Complete Counter bit 6 mask. */
#define CTE_GCAFCCC6_bp  6  /* GCAF Computation Complete Counter bit 6 position. */
#define CTE_GCAFCCCM_bm  0x80  /* GCAF Computation Complete Counter Mode bit mask. */
#define CTE_GCAFCCCM_bp  7  /* GCAF Computation Complete Counter Mode bit position. */

