gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt336s.h
/* CTE.GCAFHDLCNT  bit masks and bit positions */
#define CTE_GCAFHDLCNT_gm  0xFF  /* Headroom Detect Low Counter group mask. */
#define CTE_GCAFHDLCNT_gp  0  /* Headroom Detect Low Counter group position. */
#define CTE_GCAFHDLCNT0_bm  (1<<0)  /* Headroom Detect Low Counter bit 0 mask. */
#define CTE_GCAFHDLCNT0_bp  0  /* Headroom Detect Low Counter bit 0 position. */
#define CTE_GCAFHDLCNT1_bm  (1<<1)  /* Headroom Detect Low Counter bit 1 mask. */
#define CTE_GCAFHDLCNT1_bp  1  /* Headroom Detect Low Counter bit 1 position. */
#define CTE_GCAFHDLCNT2_bm  (1<<2)  /* Headroom Detect Low Counter bit 2 mask. */
#define CTE_GCAFHDLCNT2_bp  2  /* Headroom Detect Low Counter bit 2 position. */
#define CTE_GCAFHDLCNT3_bm  (1<<3)  /* Headroom Detect Low Counter bit 3 mask. */
#define CTE_GCAFHDLCNT3_bp  3  /* Headroom Detect Low Counter bit 3 position. */
#define CTE_GCAFHDLCNT4_bm  (1<<4)  /* Headroom Detect Low Counter bit 4 mask. */
#define CTE_GCAFHDLCNT4_bp  4  /* Headroom Detect Low Counter bit 4 position. */
#define CTE_GCAFHDLCNT5_bm  (1<<5)  /* Headroom Detect Low Counter bit 5 mask. */
#define CTE_GCAFHDLCNT5_bp  5  /* Headroom Detect Low Counter bit 5 position. */
#define CTE_GCAFHDLCNT6_bm  (1<<6)  /* Headroom Detect Low Counter bit 6 mask. */
#define CTE_GCAFHDLCNT6_bp  6  /* Headroom Detect Low Counter bit 6 position. */
#define CTE_GCAFHDLCNT7_bm  (1<<7)  /* Headroom Detect Low Counter bit 7 mask. */
#define CTE_GCAFHDLCNT7_bp  7  /* Headroom Detect Low Counter bit 7 position. */

/* CTE.GCAFHDHCNT  bit masks and bit positions */
#define CTE_GCAFHDHCNT_gm  0xFF  /* Headroom Detect High Counter group mask. */
#define CTE_GCAFHDHCNT_gp  0  /* Headroom Detect High Counter group position. */
#define CTE_GCAFHDHCNT0_bm  (1<<0)  /* Headroom Detect High Counter bit 0 mask. */
#define CTE_GCAFHDHCNT0_bp  0  /* Headroom Detect High Counter bit 0 position. */
#define CTE_GCAFHDHCNT1_bm  (1<<1)  /* Headroom Detect High Counter bit 1 mask. */
#define CTE_GCAFHDHCNT1_bp  1  /* Headroom Detect High Counter bit 1 position. */
#define CTE_GCAFHDHCNT2_bm  (1<<2)  /* Headroom Detect High Counter bit 2 mask. */
#define CTE_GCAFHDHCNT2_bp  2  /* Headroom Detect High Counter bit 2 position. */
#define CTE_GCAFHDHCNT3_bm  (1<<3)  /* Headroom Detect High Counter bit 3 mask. */
#define CTE_GCAFHDHCNT3_bp  3  /* Headroom Detect High Counter bit 3 position. */
#define CTE_GCAFHDHCNT4_bm  (1<<4)  /* Headroom Detect High Counter bit 4 mask. */
#define CTE_GCAFHDHCNT4_bp  4  /* Headroom Detect High Counter bit 4 position. */
#define CTE_GCAFHDHCNT5_bm  (1<<5)  /* Headroom Detect High Counter bit 5 mask. */
#define CTE_GCAFHDHCNT5_bp  5  /* Headroom Detect High Counter bit 5 position. */
#define CTE_GCAFHDHCNT6_bm  (1<<6)  /* Headroom Detect High Counter bit 6 mask. */
#define CTE_GCAFHDHCNT6_bp  6  /* Headroom Detect High Counter bit 6 position. */
#define CTE_GCAFHDHCNT7_bm  (1<<7)  /* Headroom Detect High Counter bit 7 mask. */
#define CTE_GCAFHDHCNT7_bp  7  /* Headroom Detect High Counter bit 7 position. */

/* CTE.GCAFMCEN  bit masks and bit positions */
#define CTE_GCAFMCEN_7_0_gm  0xFF  /* GCAF Multi-Cut Enable group mask. */
#define CTE_GCAFMCEN_7_0_gp  0  /* GCAF Multi-Cut Enable group position. */
#define CTE_GCAFMCEN_7_00_bm  (1<<0)  /* GCAF Multi-Cut Enable bit 0 mask. */
#define CTE_GCAFMCEN_7_00_bp  0  /* GCAF Multi-Cut Enable bit 0 position. */
#define CTE_GCAFMCEN_7_01_bm  (1<<1)  /* GCAF Multi-Cut Enable bit 1 mask. */
#define CTE_GCAFMCEN_7_01_bp  1  /* GCAF Multi-Cut Enable bit 1 position. */
#define CTE_GCAFMCEN_7_02_bm  (1<<2)  /* GCAF Multi-Cut Enable bit 2 mask. */
#define CTE_GCAFMCEN_7_02_bp  2  /* GCAF Multi-Cut Enable bit 2 position. */
#define CTE_GCAFMCEN_7_03_bm  (1<<3)  /* GCAF Multi-Cut Enable bit 3 mask. */
#define CTE_GCAFMCEN_7_03_bp  3  /* GCAF Multi-Cut Enable bit 3 position. */
#define CTE_GCAFMCEN_7_04_bm  (1<<4)  /* GCAF Multi-Cut Enable bit 4 mask. */
#define CTE_GCAFMCEN_7_04_bp  4  /* GCAF Multi-Cut Enable bit 4 position. */
#define CTE_GCAFMCEN_7_05_bm  (1<<5)  /* GCAF Multi-Cut Enable bit 5 mask. */
#define CTE_GCAFMCEN_7_05_bp  5  /* GCAF Multi-Cut Enable bit 5 position. */
#define CTE_GCAFMCEN_7_06_bm  (1<<6)  /* GCAF Multi-Cut Enable bit 6 mask. */
#define CTE_GCAFMCEN_7_06_bp  6  /* GCAF Multi-Cut Enable bit 6 position. */
#define CTE_GCAFMCEN_7_07_bm  (1<<7)  /* GCAF Multi-Cut Enable bit 7 mask. */
#define CTE_GCAFMCEN_7_07_bp  7  /* GCAF Multi-Cut Enable bit 7 position. */

/* CTE.GCAFCCCLIM  bit masks and bit positions */
#define CTE_GCAFCCCLIM_gm  0x7F  /* GCAF Computation Complete Counter Limit group mask. */
#define CTE_GCAFCCCLIM_gp  0  /* GCAF Computation Complete Counter Limit group position. */
#define CTE_GCAFCCCLIM0_bm  (1<<0)  /* GCAF Computation Complete Counter Limit bit 0 mask. */
#define CTE_GCAFCCCLIM0_bp  0  /* GCAF Computation Complete Counter Limit bit 0 position. */
#define CTE_GCAFCCCLIM1_bm  (1<<1)  /* GCAF Computation Complete Counter Limit bit 1 mask. */
#define CTE_GCAFCCCLIM1_bp  1  /* GCAF Computation Complete Counter Limit bit 1 position. */
#define CTE_GCAFCCCLIM2_bm  (1<<2)  /* GCAF Computation Complete Counter Limit bit 2 mask. */
#define CTE_GCAFCCCLIM2_bp  2  /* GCAF Computation Complete Counter Limit bit 2 position. */
#define CTE_GCAFCCCLIM3_bm  (1<<3)  /* GCAF Computation Complete Counter Limit bit 3 mask. */
#define CTE_GCAFCCCLIM3_bp  3  /* GCAF Computation Complete Counter Limit bit 3 position. */
#define CTE_GCAFCCCLIM4_bm  (1<<4)  /* GCAF Computation Complete Counter Limit bit 4 mask. */
#define CTE_GCAFCCCLIM4_bp  4  /* GCAF Computation Complete Counter Limit bit 4 position. */
#define CTE_GCAFCCCLIM5_bm  (1<<5)  /* GCAF Computation Complete Counter Limit bit 5 mask. */
#define CTE_GCAFCCCLIM5_bp  5  /* GCAF Computation Complete Counter Limit bit 5 position. */
#define CTE_GCAFCCCLIM6_bm  (1<<6)  /* GCAF Computation Complete Counter Limit bit 6 mask. */
#define CTE_GCAFCCCLIM6_bp  6  /* GCAF Computation Complete Counter Limit bit 6 position. */

















/* CTE.ADCCRA  bit masks and bit positions */
#define CTE_ADCPRESC_gm  0x1F  /* ADC Prescaler group mask. */
#define CTE_ADCPRESC_gp  0  /* ADC Prescaler group position. */
#define CTE_ADCPRESC0_bm  (1<<0)  /* ADC Prescaler bit 0 mask. */
#define CTE_ADCPRESC0_bp  0  /* ADC Prescaler bit 0 position. */
#define CTE_ADCPRESC1_bm  (1<<1)  /* ADC Prescaler bit 1 mask. */
#define CTE_ADCPRESC1_bp  1  /* ADC Prescaler bit 1 position. */
#define CTE_ADCPRESC2_bm  (1<<2)  /* ADC Prescaler bit 2 mask. */
#define CTE_ADCPRESC2_bp  2  /* ADC Prescaler bit 2 position. */
#define CTE_ADCPRESC3_bm  (1<<3)  /* ADC Prescaler bit 3 mask. */
#define CTE_ADCPRESC3_bp  3  /* ADC Prescaler bit 3 position. */
#define CTE_ADCPRESC4_bm  (1<<4)  /* ADC Prescaler bit 4 mask. */
#define CTE_ADCPRESC4_bp  4  /* ADC Prescaler bit 4 position. */
#define CTE_ADCAPS_bm  0x20  /* ADC Auto Power Save bit mask. */
#define CTE_ADCAPS_bp  5  /* ADC Auto Power Save bit position. */
#define CTE_ADCREFSEL_gm  0xC0  /* ADC Reference Select group mask. */
#define CTE_ADCREFSEL_gp  6  /* ADC Reference Select group position. */
#define CTE_ADCREFSEL0_bm  (1<<6)  /* ADC Reference Select bit 0 mask. */
#define CTE_ADCREFSEL0_bp  6  /* ADC Reference Select bit 0 position. */
#define CTE_ADCREFSEL1_bm  (1<<7)  /* ADC Reference Select bit 1 mask. */
#define CTE_ADCREFSEL1_bp  7  /* ADC Reference Select bit 1 position. */

/* CTE.ADCCRB  bit masks and bit positions */
#define CTE_ADCSPEED_gm  0x03  /* ADC Speed Setting group mask. */
#define CTE_ADCSPEED_gp  0  /* ADC Speed Setting group position. */
#define CTE_ADCSPEED0_bm  (1<<0)  /* ADC Speed Setting bit 0 mask. */
#define CTE_ADCSPEED0_bp  0  /* ADC Speed Setting bit 0 position. */
#define CTE_ADCSPEED1_bm  (1<<1)  /* ADC Speed Setting bit 1 mask. */
#define CTE_ADCSPEED1_bp  1  /* ADC Speed Setting bit 1 position. */
#define CTE_ADCPUEN_bm  0x04  /* ADC Pull Enable bit mask. */
#define CTE_ADCPUEN_bp  2  /* ADC Pull Enable bit position. */
#define CTE_SHSPEED_gm  0x18  /* S/H Speed Setting group mask. */
#define CTE_SHSPEED_gp  3  /* S/H Speed Setting group position. */
#define CTE_SHSPEED0_bm  (1<<3)  /* S/H Speed Setting bit 0 mask. */
#define CTE_SHSPEED0_bp  3  /* S/H Speed Setting bit 0 position. */
#define CTE_SHSPEED1_bm  (1<<4)  /* S/H Speed Setting bit 1 mask. */
#define CTE_SHSPEED1_bp  4  /* S/H Speed Setting bit 1 position. */
#define CTE_SHDCS_bm  0x40  /* S/H Dynamic Current Scaling bit mask. */
#define CTE_SHDCS_bp  6  /* S/H Dynamic Current Scaling bit position. */
#define CTE_ADCSUM_bm  0x80  /* ADC Startup Mode bit mask. */
#define CTE_ADCSUM_bp  7  /* ADC Startup Mode bit position. */

/* CTE.ADCINTCAL  bit masks and bit positions */
#define CTE_ADCCAL_gm  0xFF  /* ADC Calibration group mask. */
#define CTE_ADCCAL_gp  0  /* ADC Calibration group position. */
#define CTE_ADCCAL0_bm  (1<<0)  /* ADC Calibration bit 0 mask. */
#define CTE_ADCCAL0_bp  0  /* ADC Calibration bit 0 position. */
#define CTE_ADCCAL1_bm  (1<<1)  /* ADC Calibration bit 1 mask. */
#define CTE_ADCCAL1_bp  1  /* ADC Calibration bit 1 position. */
#define CTE_ADCCAL2_bm  (1<<2)  /* ADC Calibration bit 2 mask. */
#define CTE_ADCCAL2_bp  2  /* ADC Calibration bit 2 position. */
#define CTE_ADCCAL3_bm  (1<<3)  /* ADC Calibration bit 3 mask. */
#define CTE_ADCCAL3_bp  3  /* ADC Calibration bit 3 position. */
#define CTE_ADCCAL4_bm  (1<<4)  /* ADC Calibration bit 4 mask. */
#define CTE_ADCCAL4_bp  4  /* ADC Calibration bit 4 position. */
#define CTE_ADCCAL5_bm  (1<<5)  /* ADC Calibration bit 5 mask. */
#define CTE_ADCCAL5_bp  5  /* ADC Calibration bit 5 position. */
#define CTE_ADCCAL6_bm  (1<<6)  /* ADC Calibration bit 6 mask. */
#define CTE_ADCCAL6_bp  6  /* ADC Calibration bit 6 position. */
#define CTE_ADCCAL7_bm  (1<<7)  /* ADC Calibration bit 7 mask. */
#define CTE_ADCCAL7_bp  7  /* ADC Calibration bit 7 position. */

/* CTE.ADCRES  bit masks and bit positions */
#define CTE_ADCRES_7_0_gm  0xFF  /* ADC Conversion Result bit 7-0 group mask. */
#define CTE_ADCRES_7_0_gp  0  /* ADC Conversion Result bit 7-0 group position. */
#define CTE_ADCRES_7_00_bm  (1<<0)  /* ADC Conversion Result bit 7-0 bit 0 mask. */
#define CTE_ADCRES_7_00_bp  0  /* ADC Conversion Result bit 7-0 bit 0 position. */
#define CTE_ADCRES_7_01_bm  (1<<1)  /* ADC Conversion Result bit 7-0 bit 1 mask. */
#define CTE_ADCRES_7_01_bp  1  /* ADC Conversion Result bit 7-0 bit 1 position. */
#define CTE_ADCRES_7_02_bm  (1<<2)  /* ADC Conversion Result bit 7-0 bit 2 mask. */
#define CTE_ADCRES_7_02_bp  2  /* ADC Conversion Result bit 7-0 bit 2 position. */
#define CTE_ADCRES_7_03_bm  (1<<3)  /* ADC Conversion Result bit 7-0 bit 3 mask. */
#define CTE_ADCRES_7_03_bp  3  /* ADC Conversion Result bit 7-0 bit 3 position. */
#define CTE_ADCRES_7_04_bm  (1<<4)  /* ADC Conversion Result bit 7-0 bit 4 mask. */
#define CTE_ADCRES_7_04_bp  4  /* ADC Conversion Result bit 7-0 bit 4 position. */
#define CTE_ADCRES_7_05_bm  (1<<5)  /* ADC Conversion Result bit 7-0 bit 5 mask. */
#define CTE_ADCRES_7_05_bp  5  /* ADC Conversion Result bit 7-0 bit 5 position. */
#define CTE_ADCRES_7_06_bm  (1<<6)  /* ADC Conversion Result bit 7-0 bit 6 mask. */
#define CTE_ADCRES_7_06_bp  6  /* ADC Conversion Result bit 7-0 bit 6 position. */
#define CTE_ADCRES_7_07_bm  (1<<7)  /* ADC Conversion Result bit 7-0 bit 7 mask. */
#define CTE_ADCRES_7_07_bp  7  /* ADC Conversion Result bit 7-0 bit 7 position. */

/* CTE.ADCINTTEST  bit masks and bit positions */
#define CTE_ADCTSPEN_bm  0x01  /* ADC Test Switch Positive Enable bit mask. */
#define CTE_ADCTSPEN_bp  0  /* ADC Test Switch Positive Enable bit position. */
#define CTE_ADCTSNEN_bm  0x02  /* ADC Test Switch Negative Enable bit mask. */
#define CTE_ADCTSNEN_bp  1  /* ADC Test Switch Negative Enable bit position. */
#define CTE_ADCBTESTEN_bm  0x04  /* ADC Bias Test Enable bit mask. */
#define CTE_ADCBTESTEN_bp  2  /* ADC Bias Test Enable bit position. */
#define CTE_ADCFV_bm  0x08  /* ADC Force Valid Result bit mask. */
#define CTE_ADCFV_bp  3  /* ADC Force Valid Result bit position. */
#define CTE_INTBIST_bm  0x10  /* Integrator Built-In Self Test bit mask. */
#define CTE_INTBIST_bp  4  /* Integrator Built-In Self Test bit position. */
#define CTE_INTTESTALL_bm  0x20  /* Integrator Test All bit mask. */
#define CTE_INTTESTALL_bp  5  /* Integrator Test All bit position. */

/* CTE.ADCSHVBCAL  bit masks and bit positions */
#define CTE_ADCVBCAL_gm  0x0F  /* ADC VBias Calibration group mask. */
#define CTE_ADCVBCAL_gp  0  /* ADC VBias Calibration group position. */
#define CTE_ADCVBCAL0_bm  (1<<0)  /* ADC VBias Calibration bit 0 mask. */
#define CTE_ADCVBCAL0_bp  0  /* ADC VBias Calibration bit 0 position. */
#define CTE_ADCVBCAL1_bm  (1<<1)  /* ADC VBias Calibration bit 1 mask. */
#define CTE_ADCVBCAL1_bp  1  /* ADC VBias Calibration bit 1 position. */
#define CTE_ADCVBCAL2_bm  (1<<2)  /* ADC VBias Calibration bit 2 mask. */
#define CTE_ADCVBCAL2_bp  2  /* ADC VBias Calibration bit 2 position. */
#define CTE_ADCVBCAL3_bm  (1<<3)  /* ADC VBias Calibration bit 3 mask. */
#define CTE_ADCVBCAL3_bp  3  /* ADC VBias Calibration bit 3 position. */
#define CTE_ADCVBSEL_bm  0x10  /* ADC VBias Select bit mask. */
#define CTE_ADCVBSEL_bp  4  /* ADC VBias Select bit position. */
#define CTE_SHVBCAL_gm  0xE0  /* S/H VBias Calibration group mask. */
#define CTE_SHVBCAL_gp  5  /* S/H VBias Calibration group position. */
#define CTE_SHVBCAL0_bm  (1<<5)  /* S/H VBias Calibration bit 0 mask. */
#define CTE_SHVBCAL0_bp  5  /* S/H VBias Calibration bit 0 position. */
#define CTE_SHVBCAL1_bm  (1<<6)  /* S/H VBias Calibration bit 1 mask. */
#define CTE_SHVBCAL1_bp  6  /* S/H VBias Calibration bit 1 position. */
#define CTE_SHVBCAL2_bm  (1<<7)  /* S/H VBias Calibration bit 2 mask. */
#define CTE_SHVBCAL2_bp  7  /* S/H VBias Calibration bit 2 position. */

/* CTE.INTCRA  bit masks and bit positions */
#define CTE_INTMEN_bm  0x01  /* Integrator Master Enable bit mask. */
#define CTE_INTMEN_bp  0  /* Integrator Master Enable bit position. */
#define CTE_INTARST_bm  0x02  /* Integrator Automatic Reset bit mask. */
#define CTE_INTARST_bp  1  /* Integrator Automatic Reset bit position. */
#define CTE_INTAST_bm  0x04  /* Integrator Automatic Sign Toggle bit mask. */
#define CTE_INTAST_bp  2  /* Integrator Automatic Sign Toggle bit position. */
#define CTE_INTINCBIAS_bm  0x40  /* Integrator Increase Bias bit mask. */
#define CTE_INTINCBIAS_bp  6  /* Integrator Increase Bias bit position. */
#define CTE_INTXCHINC_bm  0x80  /* Integrator X-Channel Increment bit mask. */
#define CTE_INTXCHINC_bp  7  /* Integrator X-Channel Increment bit position. */

/* CTE.INTCRD  bit masks and bit positions */
/* CTE_INTYONX  is already defined. */
/* CTE_INTBYPASSX  is already defined. */
/* CTE_INTBYPASSY  is already defined. */
/* CTE_INTDIBUFX  is already defined. */
#define CTE_BIASY30U_bm  0x20  /* Y-line Bias Nominal Value30uA bit mask. */
#define CTE_BIASY30U_bp  5  /* Y-line Bias Nominal Value30uA bit position. */
#define CTE_INTY0TIEN_bm  0x40  /* Integrator Y0 Test Input Enable bit mask. */
#define CTE_INTY0TIEN_bp  6  /* Integrator Y0 Test Input Enable bit position. */
#define CTE_INTY1TIEN_bm  0x80  /* Integrator Y1 Test Input Enable bit mask. */
#define CTE_INTY1TIEN_bp  7  /* Integrator Y1 Test Input Enable bit position. */

/* CTE.INTEN  bit masks and bit positions */
#define CTE_INTEN_7_0_gm  0xFF  /* Integrator Enable group mask. */
#define CTE_INTEN_7_0_gp  0  /* Integrator Enable group position. */
#define CTE_INTEN_7_00_bm  (1<<0)  /* Integrator Enable bit 0 mask. */
#define CTE_INTEN_7_00_bp  0  /* Integrator Enable bit 0 position. */
#define CTE_INTEN_7_01_bm  (1<<1)  /* Integrator Enable bit 1 mask. */
#define CTE_INTEN_7_01_bp  1  /* Integrator Enable bit 1 position. */
#define CTE_INTEN_7_02_bm  (1<<2)  /* Integrator Enable bit 2 mask. */
#define CTE_INTEN_7_02_bp  2  /* Integrator Enable bit 2 position. */
#define CTE_INTEN_7_03_bm  (1<<3)  /* Integrator Enable bit 3 mask. */
#define CTE_INTEN_7_03_bp  3  /* Integrator Enable bit 3 position. */
#define CTE_INTEN_7_04_bm  (1<<4)  /* Integrator Enable bit 4 mask. */
#define CTE_INTEN_7_04_bp  4  /* Integrator Enable bit 4 position. */
#define CTE_INTEN_7_05_bm  (1<<5)  /* Integrator Enable bit 5 mask. */
#define CTE_INTEN_7_05_bp  5  /* Integrator Enable bit 5 position. */
#define CTE_INTEN_7_06_bm  (1<<6)  /* Integrator Enable bit 6 mask. */
#define CTE_INTEN_7_06_bp  6  /* Integrator Enable bit 6 position. */
#define CTE_INTEN_7_07_bm  (1<<7)  /* Integrator Enable bit 7 mask. */
#define CTE_INTEN_7_07_bp  7  /* Integrator Enable bit 7 position. */

/* CTE.INTMASKEN  bit masks and bit positions */
#define CTE_INTMASKEN_7_0_gm  0xFF  /* Integrator Mask Enable group mask. */
#define CTE_INTMASKEN_7_0_gp  0  /* Integrator Mask Enable group position. */
#define CTE_INTMASKEN_7_00_bm  (1<<0)  /* Integrator Mask Enable bit 0 mask. */
#define CTE_INTMASKEN_7_00_bp  0  /* Integrator Mask Enable bit 0 position. */
#define CTE_INTMASKEN_7_01_bm  (1<<1)  /* Integrator Mask Enable bit 1 mask. */
#define CTE_INTMASKEN_7_01_bp  1  /* Integrator Mask Enable bit 1 position. */
#define CTE_INTMASKEN_7_02_bm  (1<<2)  /* Integrator Mask Enable bit 2 mask. */
#define CTE_INTMASKEN_7_02_bp  2  /* Integrator Mask Enable bit 2 position. */
#define CTE_INTMASKEN_7_03_bm  (1<<3)  /* Integrator Mask Enable bit 3 mask. */
#define CTE_INTMASKEN_7_03_bp  3  /* Integrator Mask Enable bit 3 position. */
#define CTE_INTMASKEN_7_04_bm  (1<<4)  /* Integrator Mask Enable bit 4 mask. */
#define CTE_INTMASKEN_7_04_bp  4  /* Integrator Mask Enable bit 4 position. */
#define CTE_INTMASKEN_7_05_bm  (1<<5)  /* Integrator Mask Enable bit 5 mask. */
#define CTE_INTMASKEN_7_05_bp  5  /* Integrator Mask Enable bit 5 position. */
#define CTE_INTMASKEN_7_06_bm  (1<<6)  /* Integrator Mask Enable bit 6 mask. */
#define CTE_INTMASKEN_7_06_bp  6  /* Integrator Mask Enable bit 6 position. */
#define CTE_INTMASKEN_7_07_bm  (1<<7)  /* Integrator Mask Enable bit 7 mask. */
#define CTE_INTMASKEN_7_07_bp  7  /* Integrator Mask Enable bit 7 position. */

/* CTE.SHEN  bit masks and bit positions */
#define CTE_SHEN_7_0_gm  0xFF  /* S/H Enable group mask. */
#define CTE_SHEN_7_0_gp  0  /* S/H Enable group position. */
#define CTE_SHEN_7_00_bm  (1<<0)  /* S/H Enable bit 0 mask. */
#define CTE_SHEN_7_00_bp  0  /* S/H Enable bit 0 position. */
#define CTE_SHEN_7_01_bm  (1<<1)  /* S/H Enable bit 1 mask. */
#define CTE_SHEN_7_01_bp  1  /* S/H Enable bit 1 position. */
#define CTE_SHEN_7_02_bm  (1<<2)  /* S/H Enable bit 2 mask. */
#define CTE_SHEN_7_02_bp  2  /* S/H Enable bit 2 position. */
#define CTE_SHEN_7_03_bm  (1<<3)  /* S/H Enable bit 3 mask. */
#define CTE_SHEN_7_03_bp  3  /* S/H Enable bit 3 position. */
#define CTE_SHEN_7_04_bm  (1<<4)  /* S/H Enable bit 4 mask. */
#define CTE_SHEN_7_04_bp  4  /* S/H Enable bit 4 position. */
#define CTE_SHEN_7_05_bm  (1<<5)  /* S/H Enable bit 5 mask. */
#define CTE_SHEN_7_05_bp  5  /* S/H Enable bit 5 position. */
#define CTE_SHEN_7_06_bm  (1<<6)  /* S/H Enable bit 6 mask. */
#define CTE_SHEN_7_06_bp  6  /* S/H Enable bit 6 position. */
#define CTE_SHEN_7_07_bm  (1<<7)  /* S/H Enable bit 7 mask. */
#define CTE_SHEN_7_07_bp  7  /* S/H Enable bit 7 position. */

