gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt336s.h
/* CTE.BIASCR  bit masks and bit positions */
#define CTE_BIASXPVAL_gm  0x1F  /* X-line PMOS Bias Value group mask. */
#define CTE_BIASXPVAL_gp  0  /* X-line PMOS Bias Value group position. */
#define CTE_BIASXPVAL0_bm  (1<<0)  /* X-line PMOS Bias Value bit 0 mask. */
#define CTE_BIASXPVAL0_bp  0  /* X-line PMOS Bias Value bit 0 position. */
#define CTE_BIASXPVAL1_bm  (1<<1)  /* X-line PMOS Bias Value bit 1 mask. */
#define CTE_BIASXPVAL1_bp  1  /* X-line PMOS Bias Value bit 1 position. */
#define CTE_BIASXPVAL2_bm  (1<<2)  /* X-line PMOS Bias Value bit 2 mask. */
#define CTE_BIASXPVAL2_bp  2  /* X-line PMOS Bias Value bit 2 position. */
#define CTE_BIASXPVAL3_bm  (1<<3)  /* X-line PMOS Bias Value bit 3 mask. */
#define CTE_BIASXPVAL3_bp  3  /* X-line PMOS Bias Value bit 3 position. */
#define CTE_BIASXPVAL4_bm  (1<<4)  /* X-line PMOS Bias Value bit 4 mask. */
#define CTE_BIASXPVAL4_bp  4  /* X-line PMOS Bias Value bit 4 position. */
#define CTE_BIASXNVAL_2_0_gm  0xE0  /* X-line NMOS Bias Value bit 2-0 group mask. */
#define CTE_BIASXNVAL_2_0_gp  5  /* X-line NMOS Bias Value bit 2-0 group position. */
#define CTE_BIASXNVAL_2_00_bm  (1<<5)  /* X-line NMOS Bias Value bit 2-0 bit 0 mask. */
#define CTE_BIASXNVAL_2_00_bp  5  /* X-line NMOS Bias Value bit 2-0 bit 0 position. */
#define CTE_BIASXNVAL_2_01_bm  (1<<6)  /* X-line NMOS Bias Value bit 2-0 bit 1 mask. */
#define CTE_BIASXNVAL_2_01_bp  6  /* X-line NMOS Bias Value bit 2-0 bit 1 position. */
#define CTE_BIASXNVAL_2_02_bm  (1<<7)  /* X-line NMOS Bias Value bit 2-0 bit 2 mask. */
#define CTE_BIASXNVAL_2_02_bp  7  /* X-line NMOS Bias Value bit 2-0 bit 2 position. */

/* CTE.HVSEQT  bit masks and bit positions */
#define CTE_HVHOT_gm  0xFF  /* HV Sequencer Hold Off Time group mask. */
#define CTE_HVHOT_gp  0  /* HV Sequencer Hold Off Time group position. */
#define CTE_HVHOT0_bm  (1<<0)  /* HV Sequencer Hold Off Time bit 0 mask. */
#define CTE_HVHOT0_bp  0  /* HV Sequencer Hold Off Time bit 0 position. */
#define CTE_HVHOT1_bm  (1<<1)  /* HV Sequencer Hold Off Time bit 1 mask. */
#define CTE_HVHOT1_bp  1  /* HV Sequencer Hold Off Time bit 1 position. */
#define CTE_HVHOT2_bm  (1<<2)  /* HV Sequencer Hold Off Time bit 2 mask. */
#define CTE_HVHOT2_bp  2  /* HV Sequencer Hold Off Time bit 2 position. */
#define CTE_HVHOT3_bm  (1<<3)  /* HV Sequencer Hold Off Time bit 3 mask. */
#define CTE_HVHOT3_bp  3  /* HV Sequencer Hold Off Time bit 3 position. */
#define CTE_HVHOT4_bm  (1<<4)  /* HV Sequencer Hold Off Time bit 4 mask. */
#define CTE_HVHOT4_bp  4  /* HV Sequencer Hold Off Time bit 4 position. */
#define CTE_HVHOT5_bm  (1<<5)  /* HV Sequencer Hold Off Time bit 5 mask. */
#define CTE_HVHOT5_bp  5  /* HV Sequencer Hold Off Time bit 5 position. */
#define CTE_HVHOT6_bm  (1<<6)  /* HV Sequencer Hold Off Time bit 6 mask. */
#define CTE_HVHOT6_bp  6  /* HV Sequencer Hold Off Time bit 6 position. */
#define CTE_HVHOT7_bm  (1<<7)  /* HV Sequencer Hold Off Time bit 7 mask. */
#define CTE_HVHOT7_bp  7  /* HV Sequencer Hold Off Time bit 7 position. */

/* CTE.HDCRA  bit masks and bit positions */
#define CTE_HDHYST_bm  0x01  /* Headroom Detector Hysteresis bit mask. */
#define CTE_HDHYST_bp  0  /* Headroom Detector Hysteresis bit position. */
#define CTE_HDHBIAS_bm  0x02  /* Headroom Detector High Bias bit mask. */
#define CTE_HDHBIAS_bp  1  /* Headroom Detector High Bias bit position. */
#define CTE_HDLLVL_gm  0x1C  /* Headroom Detector Low Level Configuration group mask. */
#define CTE_HDLLVL_gp  2  /* Headroom Detector Low Level Configuration group position. */
#define CTE_HDLLVL0_bm  (1<<2)  /* Headroom Detector Low Level Configuration bit 0 mask. */
#define CTE_HDLLVL0_bp  2  /* Headroom Detector Low Level Configuration bit 0 position. */
#define CTE_HDLLVL1_bm  (1<<3)  /* Headroom Detector Low Level Configuration bit 1 mask. */
#define CTE_HDLLVL1_bp  3  /* Headroom Detector Low Level Configuration bit 1 position. */
#define CTE_HDLLVL2_bm  (1<<4)  /* Headroom Detector Low Level Configuration bit 2 mask. */
#define CTE_HDLLVL2_bp  4  /* Headroom Detector Low Level Configuration bit 2 position. */
#define CTE_HDHLVL_gm  0xE0  /* Headroom Detector High Level Configuration group mask. */
#define CTE_HDHLVL_gp  5  /* Headroom Detector High Level Configuration group position. */
#define CTE_HDHLVL0_bm  (1<<5)  /* Headroom Detector High Level Configuration bit 0 mask. */
#define CTE_HDHLVL0_bp  5  /* Headroom Detector High Level Configuration bit 0 position. */
#define CTE_HDHLVL1_bm  (1<<6)  /* Headroom Detector High Level Configuration bit 1 mask. */
#define CTE_HDHLVL1_bp  6  /* Headroom Detector High Level Configuration bit 1 position. */
#define CTE_HDHLVL2_bm  (1<<7)  /* Headroom Detector High Level Configuration bit 2 mask. */
#define CTE_HDHLVL2_bp  7  /* Headroom Detector High Level Configuration bit 2 position. */

/* CTE.HDEN  bit masks and bit positions */
#define CTE_HDEN_7_0_gm  0xFF  /* Headroom Detector Enable group mask. */
#define CTE_HDEN_7_0_gp  0  /* Headroom Detector Enable group position. */
#define CTE_HDEN_7_00_bm  (1<<0)  /* Headroom Detector Enable bit 0 mask. */
#define CTE_HDEN_7_00_bp  0  /* Headroom Detector Enable bit 0 position. */
#define CTE_HDEN_7_01_bm  (1<<1)  /* Headroom Detector Enable bit 1 mask. */
#define CTE_HDEN_7_01_bp  1  /* Headroom Detector Enable bit 1 position. */
#define CTE_HDEN_7_02_bm  (1<<2)  /* Headroom Detector Enable bit 2 mask. */
#define CTE_HDEN_7_02_bp  2  /* Headroom Detector Enable bit 2 position. */
#define CTE_HDEN_7_03_bm  (1<<3)  /* Headroom Detector Enable bit 3 mask. */
#define CTE_HDEN_7_03_bp  3  /* Headroom Detector Enable bit 3 position. */
#define CTE_HDEN_7_04_bm  (1<<4)  /* Headroom Detector Enable bit 4 mask. */
#define CTE_HDEN_7_04_bp  4  /* Headroom Detector Enable bit 4 position. */
#define CTE_HDEN_7_05_bm  (1<<5)  /* Headroom Detector Enable bit 5 mask. */
#define CTE_HDEN_7_05_bp  5  /* Headroom Detector Enable bit 5 position. */
#define CTE_HDEN_7_06_bm  (1<<6)  /* Headroom Detector Enable bit 6 mask. */
#define CTE_HDEN_7_06_bp  6  /* Headroom Detector Enable bit 6 position. */
#define CTE_HDEN_7_07_bm  (1<<7)  /* Headroom Detector Enable bit 7 mask. */
#define CTE_HDEN_7_07_bp  7  /* Headroom Detector Enable bit 7 position. */

/* CTE.HDLOW  bit masks and bit positions */
#define CTE_HDLOW_7_0_gm  0xFF  /* Headroom Detector Low Level Output group mask. */
#define CTE_HDLOW_7_0_gp  0  /* Headroom Detector Low Level Output group position. */
#define CTE_HDLOW_7_00_bm  (1<<0)  /* Headroom Detector Low Level Output bit 0 mask. */
#define CTE_HDLOW_7_00_bp  0  /* Headroom Detector Low Level Output bit 0 position. */
#define CTE_HDLOW_7_01_bm  (1<<1)  /* Headroom Detector Low Level Output bit 1 mask. */
#define CTE_HDLOW_7_01_bp  1  /* Headroom Detector Low Level Output bit 1 position. */
#define CTE_HDLOW_7_02_bm  (1<<2)  /* Headroom Detector Low Level Output bit 2 mask. */
#define CTE_HDLOW_7_02_bp  2  /* Headroom Detector Low Level Output bit 2 position. */
#define CTE_HDLOW_7_03_bm  (1<<3)  /* Headroom Detector Low Level Output bit 3 mask. */
#define CTE_HDLOW_7_03_bp  3  /* Headroom Detector Low Level Output bit 3 position. */
#define CTE_HDLOW_7_04_bm  (1<<4)  /* Headroom Detector Low Level Output bit 4 mask. */
#define CTE_HDLOW_7_04_bp  4  /* Headroom Detector Low Level Output bit 4 position. */
#define CTE_HDLOW_7_05_bm  (1<<5)  /* Headroom Detector Low Level Output bit 5 mask. */
#define CTE_HDLOW_7_05_bp  5  /* Headroom Detector Low Level Output bit 5 position. */
#define CTE_HDLOW_7_06_bm  (1<<6)  /* Headroom Detector Low Level Output bit 6 mask. */
#define CTE_HDLOW_7_06_bp  6  /* Headroom Detector Low Level Output bit 6 position. */
#define CTE_HDLOW_7_07_bm  (1<<7)  /* Headroom Detector Low Level Output bit 7 mask. */
#define CTE_HDLOW_7_07_bp  7  /* Headroom Detector Low Level Output bit 7 position. */

