gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt336s.h
/* CTE.HDHIGH  bit masks and bit positions */
#define CTE_HDHIGH_7_0_gm  0xFF  /* Headroom Detector High Level Output group mask. */
#define CTE_HDHIGH_7_0_gp  0  /* Headroom Detector High Level Output group position. */
#define CTE_HDHIGH_7_00_bm  (1<<0)  /* Headroom Detector High Level Output bit 0 mask. */
#define CTE_HDHIGH_7_00_bp  0  /* Headroom Detector High Level Output bit 0 position. */
#define CTE_HDHIGH_7_01_bm  (1<<1)  /* Headroom Detector High Level Output bit 1 mask. */
#define CTE_HDHIGH_7_01_bp  1  /* Headroom Detector High Level Output bit 1 position. */
#define CTE_HDHIGH_7_02_bm  (1<<2)  /* Headroom Detector High Level Output bit 2 mask. */
#define CTE_HDHIGH_7_02_bp  2  /* Headroom Detector High Level Output bit 2 position. */
#define CTE_HDHIGH_7_03_bm  (1<<3)  /* Headroom Detector High Level Output bit 3 mask. */
#define CTE_HDHIGH_7_03_bp  3  /* Headroom Detector High Level Output bit 3 position. */
#define CTE_HDHIGH_7_04_bm  (1<<4)  /* Headroom Detector High Level Output bit 4 mask. */
#define CTE_HDHIGH_7_04_bp  4  /* Headroom Detector High Level Output bit 4 position. */
#define CTE_HDHIGH_7_05_bm  (1<<5)  /* Headroom Detector High Level Output bit 5 mask. */
#define CTE_HDHIGH_7_05_bp  5  /* Headroom Detector High Level Output bit 5 position. */
#define CTE_HDHIGH_7_06_bm  (1<<6)  /* Headroom Detector High Level Output bit 6 mask. */
#define CTE_HDHIGH_7_06_bp  6  /* Headroom Detector High Level Output bit 6 position. */
#define CTE_HDHIGH_7_07_bm  (1<<7)  /* Headroom Detector High Level Output bit 7 mask. */
#define CTE_HDHIGH_7_07_bp  7  /* Headroom Detector High Level Output bit 7 position. */

/* CTE.GCAFCRA  bit masks and bit positions */
#define CTE_GCAFEN_bm  0x01  /* GCAF Enable bit mask. */
#define CTE_GCAFEN_bp  0  /* GCAF Enable bit position. */
#define CTE_GCAFMEDM_gm  0x0E  /* GCAF Median Mode group mask. */
#define CTE_GCAFMEDM_gp  1  /* GCAF Median Mode group position. */
#define CTE_GCAFMEDM0_bm  (1<<1)  /* GCAF Median Mode bit 0 mask. */
#define CTE_GCAFMEDM0_bp  1  /* GCAF Median Mode bit 0 position. */
#define CTE_GCAFMEDM1_bm  (1<<2)  /* GCAF Median Mode bit 1 mask. */
#define CTE_GCAFMEDM1_bp  2  /* GCAF Median Mode bit 1 position. */
#define CTE_GCAFMEDM2_bm  (1<<3)  /* GCAF Median Mode bit 2 mask. */
#define CTE_GCAFMEDM2_bp  3  /* GCAF Median Mode bit 2 position. */
#define CTE_GCAFMCMEN_bm  0x10  /* GCAF Multi-Cut Master Enable bit mask. */
#define CTE_GCAFMCMEN_bp  4  /* GCAF Multi-Cut Master Enable bit position. */
#define CTE_GCAFPCEN_bm  0x20  /* GCAF Pre-Cut Enable bit mask. */
#define CTE_GCAFPCEN_bp  5  /* GCAF Pre-Cut Enable bit position. */
#define CTE_GCAFACCM_gm  0xC0  /* GCAF Accumulate Mode group mask. */
#define CTE_GCAFACCM_gp  6  /* GCAF Accumulate Mode group position. */
#define CTE_GCAFACCM0_bm  (1<<6)  /* GCAF Accumulate Mode bit 0 mask. */
#define CTE_GCAFACCM0_bp  6  /* GCAF Accumulate Mode bit 0 position. */
#define CTE_GCAFACCM1_bm  (1<<7)  /* GCAF Accumulate Mode bit 1 mask. */
#define CTE_GCAFACCM1_bp  7  /* GCAF Accumulate Mode bit 1 position. */

/* CTE.GCAFCRB  bit masks and bit positions */
#define CTE_GCAFYDIM_gm  0x1F  /* GCAF Result Table Y Dimension group mask. */
#define CTE_GCAFYDIM_gp  0  /* GCAF Result Table Y Dimension group position. */
#define CTE_GCAFYDIM0_bm  (1<<0)  /* GCAF Result Table Y Dimension bit 0 mask. */
#define CTE_GCAFYDIM0_bp  0  /* GCAF Result Table Y Dimension bit 0 position. */
#define CTE_GCAFYDIM1_bm  (1<<1)  /* GCAF Result Table Y Dimension bit 1 mask. */
#define CTE_GCAFYDIM1_bp  1  /* GCAF Result Table Y Dimension bit 1 position. */
#define CTE_GCAFYDIM2_bm  (1<<2)  /* GCAF Result Table Y Dimension bit 2 mask. */
#define CTE_GCAFYDIM2_bp  2  /* GCAF Result Table Y Dimension bit 2 position. */
#define CTE_GCAFYDIM3_bm  (1<<3)  /* GCAF Result Table Y Dimension bit 3 mask. */
#define CTE_GCAFYDIM3_bp  3  /* GCAF Result Table Y Dimension bit 3 position. */
#define CTE_GCAFYDIM4_bm  (1<<4)  /* GCAF Result Table Y Dimension bit 4 mask. */
#define CTE_GCAFYDIM4_bp  4  /* GCAF Result Table Y Dimension bit 4 position. */
#define CTE_GCAFAM_gm  0xE0  /* GCAF Addressing Mode group mask. */
#define CTE_GCAFAM_gp  5  /* GCAF Addressing Mode group position. */
#define CTE_GCAFAM0_bm  (1<<5)  /* GCAF Addressing Mode bit 0 mask. */
#define CTE_GCAFAM0_bp  5  /* GCAF Addressing Mode bit 0 position. */
#define CTE_GCAFAM1_bm  (1<<6)  /* GCAF Addressing Mode bit 1 mask. */
#define CTE_GCAFAM1_bp  6  /* GCAF Addressing Mode bit 1 position. */
#define CTE_GCAFAM2_bm  (1<<7)  /* GCAF Addressing Mode bit 2 mask. */
#define CTE_GCAFAM2_bp  7  /* GCAF Addressing Mode bit 2 position. */

/* CTE.GCAFBASELIM  bit masks and bit positions */
#define CTE_GCAFLIM_gm  0xFF  /* GCAF Grass Cut Limit group mask. */
#define CTE_GCAFLIM_gp  0  /* GCAF Grass Cut Limit group position. */
#define CTE_GCAFLIM0_bm  (1<<0)  /* GCAF Grass Cut Limit bit 0 mask. */
#define CTE_GCAFLIM0_bp  0  /* GCAF Grass Cut Limit bit 0 position. */
#define CTE_GCAFLIM1_bm  (1<<1)  /* GCAF Grass Cut Limit bit 1 mask. */
#define CTE_GCAFLIM1_bp  1  /* GCAF Grass Cut Limit bit 1 position. */
#define CTE_GCAFLIM2_bm  (1<<2)  /* GCAF Grass Cut Limit bit 2 mask. */
#define CTE_GCAFLIM2_bp  2  /* GCAF Grass Cut Limit bit 2 position. */
#define CTE_GCAFLIM3_bm  (1<<3)  /* GCAF Grass Cut Limit bit 3 mask. */
#define CTE_GCAFLIM3_bp  3  /* GCAF Grass Cut Limit bit 3 position. */
#define CTE_GCAFLIM4_bm  (1<<4)  /* GCAF Grass Cut Limit bit 4 mask. */
#define CTE_GCAFLIM4_bp  4  /* GCAF Grass Cut Limit bit 4 position. */
#define CTE_GCAFLIM5_bm  (1<<5)  /* GCAF Grass Cut Limit bit 5 mask. */
#define CTE_GCAFLIM5_bp  5  /* GCAF Grass Cut Limit bit 5 position. */
#define CTE_GCAFLIM6_bm  (1<<6)  /* GCAF Grass Cut Limit bit 6 mask. */
#define CTE_GCAFLIM6_bp  6  /* GCAF Grass Cut Limit bit 6 position. */
#define CTE_GCAFLIM7_bm  (1<<7)  /* GCAF Grass Cut Limit bit 7 mask. */
#define CTE_GCAFLIM7_bp  7  /* GCAF Grass Cut Limit bit 7 position. */

/* CTE.GCAFPCLL  bit masks and bit positions */
#define CTE_GCAFPCLL_7_0_gm  0xFF  /* GCAF Pre-Cut Lower Limit group mask. */
#define CTE_GCAFPCLL_7_0_gp  0  /* GCAF Pre-Cut Lower Limit group position. */
#define CTE_GCAFPCLL_7_00_bm  (1<<0)  /* GCAF Pre-Cut Lower Limit bit 0 mask. */
#define CTE_GCAFPCLL_7_00_bp  0  /* GCAF Pre-Cut Lower Limit bit 0 position. */
#define CTE_GCAFPCLL_7_01_bm  (1<<1)  /* GCAF Pre-Cut Lower Limit bit 1 mask. */
#define CTE_GCAFPCLL_7_01_bp  1  /* GCAF Pre-Cut Lower Limit bit 1 position. */
#define CTE_GCAFPCLL_7_02_bm  (1<<2)  /* GCAF Pre-Cut Lower Limit bit 2 mask. */
#define CTE_GCAFPCLL_7_02_bp  2  /* GCAF Pre-Cut Lower Limit bit 2 position. */
#define CTE_GCAFPCLL_7_03_bm  (1<<3)  /* GCAF Pre-Cut Lower Limit bit 3 mask. */
#define CTE_GCAFPCLL_7_03_bp  3  /* GCAF Pre-Cut Lower Limit bit 3 position. */
#define CTE_GCAFPCLL_7_04_bm  (1<<4)  /* GCAF Pre-Cut Lower Limit bit 4 mask. */
#define CTE_GCAFPCLL_7_04_bp  4  /* GCAF Pre-Cut Lower Limit bit 4 position. */
#define CTE_GCAFPCLL_7_05_bm  (1<<5)  /* GCAF Pre-Cut Lower Limit bit 5 mask. */
#define CTE_GCAFPCLL_7_05_bp  5  /* GCAF Pre-Cut Lower Limit bit 5 position. */
#define CTE_GCAFPCLL_7_06_bm  (1<<6)  /* GCAF Pre-Cut Lower Limit bit 6 mask. */
#define CTE_GCAFPCLL_7_06_bp  6  /* GCAF Pre-Cut Lower Limit bit 6 position. */
#define CTE_GCAFPCLL_7_07_bm  (1<<7)  /* GCAF Pre-Cut Lower Limit bit 7 mask. */
#define CTE_GCAFPCLL_7_07_bp  7  /* GCAF Pre-Cut Lower Limit bit 7 position. */

/* CTE.GCAFPCUL  bit masks and bit positions */
#define CTE_GCAFPCUL_7_0_gm  0xFF  /* GCAF Pre-Cut Upper Limit group mask. */
#define CTE_GCAFPCUL_7_0_gp  0  /* GCAF Pre-Cut Upper Limit group position. */
#define CTE_GCAFPCUL_7_00_bm  (1<<0)  /* GCAF Pre-Cut Upper Limit bit 0 mask. */
#define CTE_GCAFPCUL_7_00_bp  0  /* GCAF Pre-Cut Upper Limit bit 0 position. */
#define CTE_GCAFPCUL_7_01_bm  (1<<1)  /* GCAF Pre-Cut Upper Limit bit 1 mask. */
#define CTE_GCAFPCUL_7_01_bp  1  /* GCAF Pre-Cut Upper Limit bit 1 position. */
#define CTE_GCAFPCUL_7_02_bm  (1<<2)  /* GCAF Pre-Cut Upper Limit bit 2 mask. */
#define CTE_GCAFPCUL_7_02_bp  2  /* GCAF Pre-Cut Upper Limit bit 2 position. */
#define CTE_GCAFPCUL_7_03_bm  (1<<3)  /* GCAF Pre-Cut Upper Limit bit 3 mask. */
#define CTE_GCAFPCUL_7_03_bp  3  /* GCAF Pre-Cut Upper Limit bit 3 position. */
#define CTE_GCAFPCUL_7_04_bm  (1<<4)  /* GCAF Pre-Cut Upper Limit bit 4 mask. */
#define CTE_GCAFPCUL_7_04_bp  4  /* GCAF Pre-Cut Upper Limit bit 4 position. */
#define CTE_GCAFPCUL_7_05_bm  (1<<5)  /* GCAF Pre-Cut Upper Limit bit 5 mask. */
#define CTE_GCAFPCUL_7_05_bp  5  /* GCAF Pre-Cut Upper Limit bit 5 position. */
#define CTE_GCAFPCUL_7_06_bm  (1<<6)  /* GCAF Pre-Cut Upper Limit bit 6 mask. */
#define CTE_GCAFPCUL_7_06_bp  6  /* GCAF Pre-Cut Upper Limit bit 6 position. */
#define CTE_GCAFPCUL_7_07_bm  (1<<7)  /* GCAF Pre-Cut Upper Limit bit 7 mask. */
#define CTE_GCAFPCUL_7_07_bp  7  /* GCAF Pre-Cut Upper Limit bit 7 position. */











/* CTE.CTCRA  bit masks and bit positions */
#define CTE_CT32WE_bm  0x08  /* CapTouch 32-bit Write Enable of data memory 2 bit mask. */
#define CTE_CT32WE_bp  3  /* CapTouch 32-bit Write Enable of data memory 2 bit position. */

/* DFLL - DFLL */
/* DFLL.CTRL  bit masks and bit positions */
#define DFLL_ENABLE_bm  0x01  /* DFLL Enable bit mask. */
#define DFLL_ENABLE_bp  0  /* DFLL Enable bit position. */

/* DFLL.CALA  bit masks and bit positions */
#define DFLL_CALL_gm  0x7F  /* DFLL Calibration bits [6:0] group mask. */
#define DFLL_CALL_gp  0  /* DFLL Calibration bits [6:0] group position. */
#define DFLL_CALL0_bm  (1<<0)  /* DFLL Calibration bits [6:0] bit 0 mask. */
#define DFLL_CALL0_bp  0  /* DFLL Calibration bits [6:0] bit 0 position. */
#define DFLL_CALL1_bm  (1<<1)  /* DFLL Calibration bits [6:0] bit 1 mask. */
#define DFLL_CALL1_bp  1  /* DFLL Calibration bits [6:0] bit 1 position. */
#define DFLL_CALL2_bm  (1<<2)  /* DFLL Calibration bits [6:0] bit 2 mask. */
#define DFLL_CALL2_bp  2  /* DFLL Calibration bits [6:0] bit 2 position. */
#define DFLL_CALL3_bm  (1<<3)  /* DFLL Calibration bits [6:0] bit 3 mask. */
#define DFLL_CALL3_bp  3  /* DFLL Calibration bits [6:0] bit 3 position. */
#define DFLL_CALL4_bm  (1<<4)  /* DFLL Calibration bits [6:0] bit 4 mask. */
#define DFLL_CALL4_bp  4  /* DFLL Calibration bits [6:0] bit 4 position. */
#define DFLL_CALL5_bm  (1<<5)  /* DFLL Calibration bits [6:0] bit 5 mask. */
#define DFLL_CALL5_bp  5  /* DFLL Calibration bits [6:0] bit 5 position. */
#define DFLL_CALL6_bm  (1<<6)  /* DFLL Calibration bits [6:0] bit 6 mask. */
#define DFLL_CALL6_bp  6  /* DFLL Calibration bits [6:0] bit 6 position. */

/* DFLL.CALB  bit masks and bit positions */
#define DFLL_CALH_gm  0x3F  /* DFLL Calibration bits [12:7] group mask. */
#define DFLL_CALH_gp  0  /* DFLL Calibration bits [12:7] group position. */
#define DFLL_CALH0_bm  (1<<0)  /* DFLL Calibration bits [12:7] bit 0 mask. */
#define DFLL_CALH0_bp  0  /* DFLL Calibration bits [12:7] bit 0 position. */
#define DFLL_CALH1_bm  (1<<1)  /* DFLL Calibration bits [12:7] bit 1 mask. */
#define DFLL_CALH1_bp  1  /* DFLL Calibration bits [12:7] bit 1 position. */
#define DFLL_CALH2_bm  (1<<2)  /* DFLL Calibration bits [12:7] bit 2 mask. */
#define DFLL_CALH2_bp  2  /* DFLL Calibration bits [12:7] bit 2 position. */
#define DFLL_CALH3_bm  (1<<3)  /* DFLL Calibration bits [12:7] bit 3 mask. */
#define DFLL_CALH3_bp  3  /* DFLL Calibration bits [12:7] bit 3 position. */
#define DFLL_CALH4_bm  (1<<4)  /* DFLL Calibration bits [12:7] bit 4 mask. */
#define DFLL_CALH4_bp  4  /* DFLL Calibration bits [12:7] bit 4 position. */
#define DFLL_CALH5_bm  (1<<5)  /* DFLL Calibration bits [12:7] bit 5 mask. */
#define DFLL_CALH5_bp  5  /* DFLL Calibration bits [12:7] bit 5 position. */










/* MCU - MCU Control */
/* MCU.MCUCR  bit masks and bit positions */
#define MCU_JTAGD_bm  0x01  /* JTAG Disable bit mask. */
#define MCU_JTAGD_bp  0  /* JTAG Disable bit position. */

/* MCU.EVSYSLOCK  bit masks and bit positions */
#define MCU_EVSYS0LOCK_bm  0x01  /* Event Channel 0-3 Lock bit mask. */
#define MCU_EVSYS0LOCK_bp  0  /* Event Channel 0-3 Lock bit position. */
#define MCU_EVSYS1LOCK_bm  0x10  /* Event Channel 4-7 Lock bit mask. */
#define MCU_EVSYS1LOCK_bp  4  /* Event Channel 4-7 Lock bit position. */

