gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt336s.h
/* XOCD - On-Chip Debug System */
/* OCD.OCDR0  bit masks and bit positions */
#define OCD_OCDRD_gm  0xFF  /* OCDR Dirty group mask. */
#define OCD_OCDRD_gp  0  /* OCDR Dirty group position. */
#define OCD_OCDRD0_bm  (1<<0)  /* OCDR Dirty bit 0 mask. */
#define OCD_OCDRD0_bp  0  /* OCDR Dirty bit 0 position. */
#define OCD_OCDRD1_bm  (1<<1)  /* OCDR Dirty bit 1 mask. */
#define OCD_OCDRD1_bp  1  /* OCDR Dirty bit 1 position. */
#define OCD_OCDRD2_bm  (1<<2)  /* OCDR Dirty bit 2 mask. */
#define OCD_OCDRD2_bp  2  /* OCDR Dirty bit 2 position. */
#define OCD_OCDRD3_bm  (1<<3)  /* OCDR Dirty bit 3 mask. */
#define OCD_OCDRD3_bp  3  /* OCDR Dirty bit 3 position. */
#define OCD_OCDRD4_bm  (1<<4)  /* OCDR Dirty bit 4 mask. */
#define OCD_OCDRD4_bp  4  /* OCDR Dirty bit 4 position. */
#define OCD_OCDRD5_bm  (1<<5)  /* OCDR Dirty bit 5 mask. */
#define OCD_OCDRD5_bp  5  /* OCDR Dirty bit 5 position. */
#define OCD_OCDRD6_bm  (1<<6)  /* OCDR Dirty bit 6 mask. */
#define OCD_OCDRD6_bp  6  /* OCDR Dirty bit 6 position. */
#define OCD_OCDRD7_bm  (1<<7)  /* OCDR Dirty bit 7 mask. */
#define OCD_OCDRD7_bp  7  /* OCDR Dirty bit 7 position. */

/* OCD.OCDR1  bit masks and bit positions */
/* OCD_OCDRD  is already defined. */



// Generic Port Pins

#define PIN0_bm 0x01
#define PIN0_bp 0
#define PIN1_bm 0x02
#define PIN1_bp 1
#define PIN2_bm 0x04
#define PIN2_bp 2
#define PIN3_bm 0x08
#define PIN3_bp 3
#define PIN4_bm 0x10
#define PIN4_bp 4
#define PIN5_bm 0x20
#define PIN5_bp 5
#define PIN6_bm 0x40
#define PIN6_bp 6
#define PIN7_bm 0x80
#define PIN7_bp 7

/* ========== Interrupt Vector Definitions ========== */
/* Vector 0 is the reset vector */

/* PORTC interrupt vectors */
#define PORTC_INT0_vect_num  1
#define PORTC_INT0_vect      _VECTOR(1)  /* External Interrupt 0 */
#define PORTC_INT1_vect_num  2
#define PORTC_INT1_vect      _VECTOR(2)  /* External Interrupt 1 */

/* RTC interrupt vectors */
#define RTC_OVF_vect_num  3
#define RTC_OVF_vect      _VECTOR(3)  /* Overflow Interrupt */
#define RTC_COMP_vect_num  4
#define RTC_COMP_vect      _VECTOR(4)  /* Compare Interrupt */

/* TWIC interrupt vectors */
#define TWIC_TWIS_vect_num  5
#define TWIC_TWIS_vect      _VECTOR(5)  /* TWI Slave Interrupt */
#define TWIC_TWIM_vect_num  6
#define TWIC_TWIM_vect      _VECTOR(6)  /* TWI Master Interrupt */

/* TCC0 interrupt vectors */
#define TCC0_OVF_vect_num  7
#define TCC0_OVF_vect      _VECTOR(7)  /* Overflow Interrupt */
#define TCC0_ERR_vect_num  8
#define TCC0_ERR_vect      _VECTOR(8)  /* Error Interrupt */
#define TCC0_CCA_vect_num  9
#define TCC0_CCA_vect      _VECTOR(9)  /* Compare or Capture A Interrupt */
#define TCC0_CCB_vect_num  10
#define TCC0_CCB_vect      _VECTOR(10)  /* Compare or Capture B Interrupt */
#define TCC0_CCC_vect_num  11
#define TCC0_CCC_vect      _VECTOR(11)  /* Compare or Capture C Interrupt */
#define TCC0_CCD_vect_num  12
#define TCC0_CCD_vect      _VECTOR(12)  /* Compare or Capture D Interrupt */

/* TCC1 interrupt vectors */
#define TCC1_OVF_vect_num  13
#define TCC1_OVF_vect      _VECTOR(13)  /* Overflow Interrupt */
#define TCC1_ERR_vect_num  14
#define TCC1_ERR_vect      _VECTOR(14)  /* Error Interrupt */
#define TCC1_CCA_vect_num  15
#define TCC1_CCA_vect      _VECTOR(15)  /* Compare or Capture A Interrupt */
#define TCC1_CCB_vect_num  16
#define TCC1_CCB_vect      _VECTOR(16)  /* Compare or Capture B Interrupt */

/* SPIC interrupt vectors */
#define SPIC_INT_vect_num  17
#define SPIC_INT_vect      _VECTOR(17)  /* SPI Interrupt */

/* USARTC0 interrupt vectors */
#define USARTC0_RXC_vect_num  18
#define USARTC0_RXC_vect      _VECTOR(18)  /* Reception Complete Interrupt */
#define USARTC0_DRE_vect_num  19
#define USARTC0_DRE_vect      _VECTOR(19)  /* Data Register Empty Interrupt */
#define USARTC0_TXC_vect_num  20
#define USARTC0_TXC_vect      _VECTOR(20)  /* Transmission Complete Interrupt */

/* CTE interrupt vectors */
#define CTE_MS0_vect_num  24
#define CTE_MS0_vect      _VECTOR(24)  /* uSequencer 0 Interrupt */
#define CTE_MS1_vect_num  25
#define CTE_MS1_vect      _VECTOR(25)  /* uSequencer 1 Interrupt */

/* NVM interrupt vectors */
#define NVM_SPM_vect_num  28
#define NVM_SPM_vect      _VECTOR(28)  /* SPM Interrupt */

#define _VECTOR_SIZE 4 /* Size of individual vector. */
#define _VECTORS_SIZE (29 * _VECTOR_SIZE)


/* ========== Constants ========== */

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define PROGMEM_START     (0x0000)
#  define PROGMEM_SIZE      (53248)
#else
#  define PROGMEM_START     (0x0000U)
#  define PROGMEM_SIZE      (53248U)
#endif
#define PROGMEM_END       (PROGMEM_START + PROGMEM_SIZE - 1)

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define APP_SECTION_START     (0x0000)
#  define APP_SECTION_SIZE      (49152)
#  define APP_SECTION_PAGE_SIZE (256)
#else
#  define APP_SECTION_START     (0x0000U)
#  define APP_SECTION_SIZE      (49152U)
#  define APP_SECTION_PAGE_SIZE (256U)
#endif
#define APP_SECTION_END       (APP_SECTION_START + APP_SECTION_SIZE - 1)

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define APPTABLE_SECTION_START     (0xB000)
#  define APPTABLE_SECTION_SIZE      (4096)
#  define APPTABLE_SECTION_PAGE_SIZE (256)
#else
#  define APPTABLE_SECTION_START     (0xB000U)
#  define APPTABLE_SECTION_SIZE      (4096U)
#  define APPTABLE_SECTION_PAGE_SIZE (256U)
#endif
#define APPTABLE_SECTION_END       (APPTABLE_SECTION_START + APPTABLE_SECTION_SIZE - 1)

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define BOOT_SECTION_START     (0xC000)
#  define BOOT_SECTION_SIZE      (4096)
#  define BOOT_SECTION_PAGE_SIZE (256)
#else
#  define BOOT_SECTION_START     (0xC000U)
#  define BOOT_SECTION_SIZE      (4096U)
#  define BOOT_SECTION_PAGE_SIZE (256U)
#endif
#define BOOT_SECTION_END       (BOOT_SECTION_START + BOOT_SECTION_SIZE - 1)

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define DATAMEM_START     (0x0000)
#  define DATAMEM_SIZE      (14336)
#else
#  define DATAMEM_START     (0x0000U)
#  define DATAMEM_SIZE      (14336U)
#endif
#define DATAMEM_END       (DATAMEM_START + DATAMEM_SIZE - 1)

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define IO_START     (0x0000)
#  define IO_SIZE      (4096)
#  define IO_PAGE_SIZE (0)
#else
#  define IO_START     (0x0000U)
#  define IO_SIZE      (4096U)
#  define IO_PAGE_SIZE (0U)
#endif
#define IO_END       (IO_START + IO_SIZE - 1)

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define INTERNAL_SRAM_START     (0x2000)
#  define INTERNAL_SRAM_SIZE      (22528)
#  define INTERNAL_SRAM_PAGE_SIZE (0)
#else
#  define INTERNAL_SRAM_START     (0x2000U)
#  define INTERNAL_SRAM_SIZE      (22528U)
#  define INTERNAL_SRAM_PAGE_SIZE (0U)
#endif
#define INTERNAL_SRAM_END       (INTERNAL_SRAM_START + INTERNAL_SRAM_SIZE - 1)

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define CPU_RAM_START     (0x2000)
#  define CPU_RAM_SIZE      (4096)
#  define CPU_RAM_PAGE_SIZE (0)
#else
#  define CPU_RAM_START     (0x2000U)
#  define CPU_RAM_SIZE      (4096U)
#  define CPU_RAM_PAGE_SIZE (0U)
#endif
#define CPU_RAM_END       (CPU_RAM_START + CPU_RAM_SIZE - 1)

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define CTE_IO_START     (0x3000)
#  define CTE_IO_SIZE      (1536)
#  define CTE_IO_PAGE_SIZE (0)
#else
#  define CTE_IO_START     (0x3000U)
#  define CTE_IO_SIZE      (1536U)
#  define CTE_IO_PAGE_SIZE (0U)
#endif
#define CTE_IO_END       (CTE_IO_START + CTE_IO_SIZE - 1)

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define CTE_D0_START     (0x3800)
#  define CTE_D0_SIZE      (1024)
#  define CTE_D0_PAGE_SIZE (0)
#else
#  define CTE_D0_START     (0x3800U)
#  define CTE_D0_SIZE      (1024U)
#  define CTE_D0_PAGE_SIZE (0U)
#endif
#define CTE_D0_END       (CTE_D0_START + CTE_D0_SIZE - 1)

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define CTE_I1_START     (0x4000)
#  define CTE_I1_SIZE      (2048)
#  define CTE_I1_PAGE_SIZE (0)
#else
#  define CTE_I1_START     (0x4000U)
#  define CTE_I1_SIZE      (2048U)
#  define CTE_I1_PAGE_SIZE (0U)
#endif
#define CTE_I1_END       (CTE_I1_START + CTE_I1_SIZE - 1)

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define CTE_D1_START     (0x6000)
#  define CTE_D1_SIZE      (4096)
#  define CTE_D1_PAGE_SIZE (0)
#else
#  define CTE_D1_START     (0x6000U)
#  define CTE_D1_SIZE      (4096U)
#  define CTE_D1_PAGE_SIZE (0U)
#endif
#define CTE_D1_END       (CTE_D1_START + CTE_D1_SIZE - 1)

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define CTE_D2_START     (0x7000)
#  define CTE_D2_SIZE      (2048)
#  define CTE_D2_PAGE_SIZE (0)
#else
#  define CTE_D2_START     (0x7000U)
#  define CTE_D2_SIZE      (2048U)
#  define CTE_D2_PAGE_SIZE (0U)
#endif
#define CTE_D2_END       (CTE_D2_START + CTE_D2_SIZE - 1)

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define SIGNATURES_START     (0x0000)
#  define SIGNATURES_SIZE      (3)
#  define SIGNATURES_PAGE_SIZE (0)
#else
#  define SIGNATURES_START     (0x0000U)
#  define SIGNATURES_SIZE      (3U)
#  define SIGNATURES_PAGE_SIZE (0U)
#endif
#define SIGNATURES_END       (SIGNATURES_START + SIGNATURES_SIZE - 1)

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define FUSES_START     (0x0000)
#  define FUSES_SIZE      (6)
#  define FUSES_PAGE_SIZE (0)
#else
#  define FUSES_START     (0x0000U)
#  define FUSES_SIZE      (6U)
#  define FUSES_PAGE_SIZE (0U)
#endif
#define FUSES_END       (FUSES_START + FUSES_SIZE - 1)

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define LOCKBITS_START     (0x0000)
#  define LOCKBITS_SIZE      (1)
#  define LOCKBITS_PAGE_SIZE (0)
#else
#  define LOCKBITS_START     (0x0000U)
#  define LOCKBITS_SIZE      (1U)
#  define LOCKBITS_PAGE_SIZE (0U)
#endif
#define LOCKBITS_END       (LOCKBITS_START + LOCKBITS_SIZE - 1)

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define USER_SIGNATURES_START     (0x0000)
#  define USER_SIGNATURES_SIZE      (256)
#  define USER_SIGNATURES_PAGE_SIZE (256)
#else
#  define USER_SIGNATURES_START     (0x0000U)
#  define USER_SIGNATURES_SIZE      (256U)
#  define USER_SIGNATURES_PAGE_SIZE (256U)
#endif
#define USER_SIGNATURES_END       (USER_SIGNATURES_START + USER_SIGNATURES_SIZE - 1)

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define PROD_SIGNATURES_START     (0x0000)
#  define PROD_SIGNATURES_SIZE      (256)
#  define PROD_SIGNATURES_PAGE_SIZE (256)
#else
#  define PROD_SIGNATURES_START     (0x0000U)
#  define PROD_SIGNATURES_SIZE      (256U)
#  define PROD_SIGNATURES_PAGE_SIZE (256U)
#endif
#define PROD_SIGNATURES_END       (PROD_SIGNATURES_START + PROD_SIGNATURES_SIZE - 1)

#define FLASHSTART   PROGMEM_START
#define FLASHEND     PROGMEM_END
#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define SPM_PAGESIZE 256
#else
#  define SPM_PAGESIZE 256U
#endif
#define RAMSTART     INTERNAL_SRAM_START
#define RAMSIZE      INTERNAL_SRAM_SIZE
#define RAMEND       INTERNAL_SRAM_END


/* ========== Fuses ========== */
#define FUSE_MEMORY_SIZE 6

/* Fuse Byte 0 Reserved */

/* Fuse Byte 1 Reserved */

/* Fuse Byte 2 Reserved */

